[Killed] BlockStatement
src/modules/auth/auth.controller.ts:7:78
 import { AppError } from "../../utils/errors";
 
 export class AuthController {
-  static async registerHandler(request: FastifyRequest, reply: FastifyReply) {
-    if (request.user?.role !== "GERENTE") {
-      throw new AppError("Acesso negado", 403);
-    }
-
-    const data = registerSchema.parse(request.body);
-    const result = await AuthService.register(data);
-
-    return reply.status(201).send(result);
-  }
+  static async registerHandler(request: FastifyRequest, reply: FastifyReply) {}
 
   static async loginHandler(request: FastifyRequest, reply: FastifyReply) {
killedBy: auth routes POST /auth/register returns 201 and creates a user
statusReason: expected 200 to be 201 // Object.is equality

[Killed] ConditionalExpression
src/modules/auth/auth.controller.ts:8:9
 
 export class AuthController {
   static async registerHandler(request: FastifyRequest, reply: FastifyReply) {
-    if (request.user?.role !== "GERENTE") {
+    if (true) {
       throw new AppError("Acesso negado", 403);
     }
killedBy: auth routes POST /auth/register returns 201 and creates a user
statusReason: expected 403 to be 201 // Object.is equality

[Killed] EqualityOperator
src/modules/auth/auth.controller.ts:8:9
 
 export class AuthController {
   static async registerHandler(request: FastifyRequest, reply: FastifyReply) {
-    if (request.user?.role !== "GERENTE") {
+    if (request.user?.role === "GERENTE") {
       throw new AppError("Acesso negado", 403);
     }
killedBy: auth routes POST /auth/register returns 201 and creates a user
statusReason: expected 403 to be 201 // Object.is equality

[Killed] BlockStatement
src/modules/auth/auth.controller.ts:18:75
     return reply.status(201).send(result);
   }
 
-  static async loginHandler(request: FastifyRequest, reply: FastifyReply) {
-    const data = loginSchema.parse(request.body);
-    const result = await AuthService.login(data);
-
-    return reply.status(200).send(result);
-  }
+  static async loginHandler(request: FastifyRequest, reply: FastifyReply) {}
 }
 
killedBy: RF-02 — Login de Usuário (Blackbox) TC-RF02-05 - Impedir login com campos de usuário e senha em branco
statusReason: expected 200 to be 400 // Object.is equality
