[Killed] ArrayDeclaration
src/modules/files/files.controller.ts:19:39
                 return res.status(400).send({ error: "Nenhum arquivo foi enviado." });
             }
 
-            const allowedExtensions = [".stl", ".gcode", ".3mf", ".png", ".jpg", ".jpeg"];
+            const allowedExtensions = [];
             const fileExt = path.extname(data.filename).toLowerCase();
             if (!allowedExtensions.includes(fileExt)) {
killedBy: RF-17 — Upload de Arquivos 3D em Pedidos (Blackbox) TC-RF17-01 - Fazer upload de arquivo 'peca_suporte.stl' (5 MB) válido
statusReason: expected 400 to be 201 // Object.is equality

[Killed] StringLiteral
src/modules/files/files.controller.ts:19:66
                 return res.status(400).send({ error: "Nenhum arquivo foi enviado." });
             }
 
-            const allowedExtensions = [".stl", ".gcode", ".3mf", ".png", ".jpg", ".jpeg"];
+            const allowedExtensions = [".stl", ".gcode", ".3mf", "", ".jpg", ".jpeg"];
             const fileExt = path.extname(data.filename).toLowerCase();
             if (!allowedExtensions.includes(fileExt)) {
killedBy: files routes POST /files returns 201 and the file metadata when upload succeeds
statusReason: expected 400 to be 201 // Object.is equality

[Killed] MethodExpression
src/modules/files/files.controller.ts:20:29
             }
 
             const allowedExtensions = [".stl", ".gcode", ".3mf", ".png", ".jpg", ".jpeg"];
-            const fileExt = path.extname(data.filename).toLowerCase();
+            const fileExt = path.extname(data.filename).toUpperCase();
             if (!allowedExtensions.includes(fileExt)) {
                 return res.status(400).send({
killedBy: RF-17 — Upload de Arquivos 3D em Pedidos (Blackbox) TC-RF17-01 - Fazer upload de arquivo 'peca_suporte.stl' (5 MB) válido
statusReason: expected 400 to be 201 // Object.is equality

[Killed] BooleanLiteral
src/modules/files/files.controller.ts:21:17
 
             const allowedExtensions = [".stl", ".gcode", ".3mf", ".png", ".jpg", ".jpeg"];
             const fileExt = path.extname(data.filename).toLowerCase();
-            if (!allowedExtensions.includes(fileExt)) {
+            if (allowedExtensions.includes(fileExt)) {
                 return res.status(400).send({
                     error: `Formato de arquivo não suportado: ${fileExt}. Formatos aceitos: ${allowedExtensions.join(", ")}`
killedBy: RF-17 — Upload de Arquivos 3D em Pedidos (Blackbox) TC-RF17-01 - Fazer upload de arquivo 'peca_suporte.stl' (5 MB) válido
statusReason: expected 400 to be 201 // Object.is equality

[Killed] ConditionalExpression
src/modules/files/files.controller.ts:21:17
 
             const allowedExtensions = [".stl", ".gcode", ".3mf", ".png", ".jpg", ".jpeg"];
             const fileExt = path.extname(data.filename).toLowerCase();
-            if (!allowedExtensions.includes(fileExt)) {
+            if (true) {
                 return res.status(400).send({
                     error: `Formato de arquivo não suportado: ${fileExt}. Formatos aceitos: ${allowedExtensions.join(", ")}`
killedBy: RF-17 — Upload de Arquivos 3D em Pedidos (Blackbox) TC-RF17-01 - Fazer upload de arquivo 'peca_suporte.stl' (5 MB) válido
statusReason: expected 400 to be 201 // Object.is equality

[Killed] ArithmeticOperator
src/modules/files/files.controller.ts:27:30
                 });
             }
 
-            const MAX_SIZE = 50 * 1024 * 1024;
+            const MAX_SIZE = 50 / 1024 * 1024;
             const contentLength = Number(req.headers["content-length"]);
             if (contentLength > MAX_SIZE) {
killedBy: files routes POST /files returns 201 and the file metadata when upload succeeds
statusReason: expected 400 to be 201 // Object.is equality

[Killed] ArithmeticOperator
src/modules/files/files.controller.ts:27:30
                 });
             }
 
-            const MAX_SIZE = 50 * 1024 * 1024;
+            const MAX_SIZE = 50 * 1024 / 1024;
             const contentLength = Number(req.headers["content-length"]);
             if (contentLength > MAX_SIZE) {
killedBy: files routes POST /files returns 201 and the file metadata when upload succeeds
statusReason: expected 400 to be 201 // Object.is equality

[Killed] StringLiteral
src/modules/files/files.controller.ts:28:54
             }
 
             const MAX_SIZE = 50 * 1024 * 1024;
-            const contentLength = Number(req.headers["content-length"]);
+            const contentLength = Number(req.headers[""]);
             if (contentLength > MAX_SIZE) {
                 return res.status(400).send({
killedBy: RF-17 — Upload de Arquivos 3D em Pedidos (Blackbox) TC-RF17-04 - Rejeitar arquivo acima do limite permitido de 50 MB (ex: 50.1 MB)
statusReason: expected 201 to be 400 // Object.is equality

[Killed] ConditionalExpression
src/modules/files/files.controller.ts:29:17
 
             const MAX_SIZE = 50 * 1024 * 1024;
             const contentLength = Number(req.headers["content-length"]);
-            if (contentLength > MAX_SIZE) {
+            if (false) {
                 return res.status(400).send({
                     error: `Arquivo excede o limite de 50MB.`
killedBy: RF-17 — Upload de Arquivos 3D em Pedidos (Blackbox) TC-RF17-04 - Rejeitar arquivo acima do limite permitido de 50 MB (ex: 50.1 MB)
statusReason: expected 201 to be 400 // Object.is equality

[Killed] BlockStatement
src/modules/files/files.controller.ts:29:43
 
             const MAX_SIZE = 50 * 1024 * 1024;
             const contentLength = Number(req.headers["content-length"]);
-            if (contentLength > MAX_SIZE) {
-                return res.status(400).send({
-                    error: `Arquivo excede o limite de 50MB.`
-                });
-            }
+            if (contentLength > MAX_SIZE) {}
 
             const result = await filesService.uploadFile(data);
killedBy: RF-17 — Upload de Arquivos 3D em Pedidos (Blackbox) TC-RF17-04 - Rejeitar arquivo acima do limite permitido de 50 MB (ex: 50.1 MB)
statusReason: expected 201 to be 400 // Object.is equality

[Survived] StringLiteral
src/modules/files/files.controller.ts:31:28
             const contentLength = Number(req.headers["content-length"]);
             if (contentLength > MAX_SIZE) {
                 return res.status(400).send({
-                    error: `Arquivo excede o limite de 50MB.`
+                    error: ``
                 });
             }

[Killed] BlockStatement
src/modules/files/files.controller.ts:38:25
             const result = await filesService.uploadFile(data);
 
             return res.status(201).send(result);
-        } catch (error) {
-            console.error("Erro no handleUpload:", error);
-            return res.status(500).send({ error: "Erro interno ao processar o upload." });
-        }
+        } catch (error) {}
     }
 
killedBy: files routes POST /files returns 500 when upload driver fails
statusReason: expected 200 to be 500 // Object.is equality

[Survived] StringLiteral
src/modules/files/files.controller.ts:39:27
 
             return res.status(201).send(result);
         } catch (error) {
-            console.error("Erro no handleUpload:", error);
+            console.error("", error);
             return res.status(500).send({ error: "Erro interno ao processar o upload." });
         }

[Killed] BlockStatement
src/modules/files/files.controller.ts:44:61
         }
     }
 
-    async handleGet(req: FastifyRequest, res: FastifyReply) {
-        try {
-            const { fileName } = req.params as { fileName: string };
-
-            if (!fileName) {
-                return res.status(400).send({ error: "Nome do arquivo não informado." });
-            }
-
-            const { stream, contentType } = await filesService.getFile(fileName);
-
-            res.header("Content-Type", contentType);
-
-            return res.send(stream as Readable);
-        } catch (error) {
-            console.error("Erro no handlerGet:", error);
-            return res.status(404).send({ error: "Arquivo não encontrado." });
-        }
-    }
+    async handleGet(req: FastifyRequest, res: FastifyReply) {}
 
     async handleDelete(req: FastifyRequest, res: FastifyReply) {
killedBy: files routes GET /files/:fileName returns 200 and the file stream when file exists
statusReason: expected undefined to be 'image/png' // Object.is equality

[Killed] BlockStatement
src/modules/files/files.controller.ts:45:13
     }
 
     async handleGet(req: FastifyRequest, res: FastifyReply) {
-        try {
-            const { fileName } = req.params as { fileName: string };
-
-            if (!fileName) {
-                return res.status(400).send({ error: "Nome do arquivo não informado." });
-            }
-
-            const { stream, contentType } = await filesService.getFile(fileName);
-
-            res.header("Content-Type", contentType);
-
-            return res.send(stream as Readable);
-        } catch (error) {
+        try {} catch (error) {
             console.error("Erro no handlerGet:", error);
             return res.status(404).send({ error: "Arquivo não encontrado." });
killedBy: files routes GET /files/:fileName returns 200 and the file stream when file exists
statusReason: expected undefined to be 'image/png' // Object.is equality

[Killed] BooleanLiteral
src/modules/files/files.controller.ts:48:17
         try {
             const { fileName } = req.params as { fileName: string };
 
-            if (!fileName) {
+            if (fileName) {
                 return res.status(400).send({ error: "Nome do arquivo não informado." });
             }
killedBy: files routes GET /files/:fileName returns 200 and the file stream when file exists
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/modules/files/files.controller.ts:48:17
         try {
             const { fileName } = req.params as { fileName: string };
 
-            if (!fileName) {
+            if (true) {
                 return res.status(400).send({ error: "Nome do arquivo não informado." });
             }
killedBy: files routes GET /files/:fileName returns 200 and the file stream when file exists
statusReason: expected 400 to be 200 // Object.is equality

[Killed] StringLiteral
src/modules/files/files.controller.ts:54:24
 
             const { stream, contentType } = await filesService.getFile(fileName);
 
-            res.header("Content-Type", contentType);
+            res.header("", contentType);
 
             return res.send(stream as Readable);
killedBy: files routes GET /files/:fileName returns 200 and the file stream when file exists
statusReason: expected 'text/plain; charset=utf-8' to be 'image/png' // Object.is equality

[Killed] BlockStatement
src/modules/files/files.controller.ts:57:25
             res.header("Content-Type", contentType);
 
             return res.send(stream as Readable);
-        } catch (error) {
-            console.error("Erro no handlerGet:", error);
-            return res.status(404).send({ error: "Arquivo não encontrado." });
-        }
+        } catch (error) {}
     }
 
killedBy: files routes GET /files/:fileName returns 404 when file does not exist in MinIO
statusReason: expected 200 to be 404 // Object.is equality

[Killed] StringLiteral
src/modules/files/files.controller.ts:59:50
             return res.send(stream as Readable);
         } catch (error) {
             console.error("Erro no handlerGet:", error);
-            return res.status(404).send({ error: "Arquivo não encontrado." });
+            return res.status(404).send({ error: "" });
         }
     }
killedBy: files routes GET /files/:fileName returns 404 when file does not exist in MinIO
statusReason: expected { error: '' } to deeply equal { error: 'Arquivo não encontrado.' }

[Killed] BlockStatement
src/modules/files/files.controller.ts:63:64
         }
     }
 
-    async handleDelete(req: FastifyRequest, res: FastifyReply) {
-        try {
-            const { fileName } = req.params as { fileName: string };
-
-            if (!fileName) {
-                return res.status(400).send({ error: "Nome do arquivo não informado." });
-            }
-
-            const result = await filesService.deleteFile(fileName);
-
-            return res.status(200).send(result);
-        } catch (error) {
-            console.error("Erro no handleDelete:", error);
-            return res.status(500).send({ error: "Erro interno ao deletar o arquivo." });
-        }
-    }
+    async handleDelete(req: FastifyRequest, res: FastifyReply) {}
 }
 
killedBy: files routes DELETE /files/:fileName returns 200 when file is successfully deleted
statusReason: Unexpected end of JSON input

[Killed] BlockStatement
src/modules/files/files.controller.ts:64:13
     }
 
     async handleDelete(req: FastifyRequest, res: FastifyReply) {
-        try {
-            const { fileName } = req.params as { fileName: string };
-
-            if (!fileName) {
-                return res.status(400).send({ error: "Nome do arquivo não informado." });
-            }
-
-            const result = await filesService.deleteFile(fileName);
-
-            return res.status(200).send(result);
-        } catch (error) {
+        try {} catch (error) {
             console.error("Erro no handleDelete:", error);
             return res.status(500).send({ error: "Erro interno ao deletar o arquivo." });
killedBy: files routes DELETE /files/:fileName returns 200 when file is successfully deleted
statusReason: Unexpected end of JSON input

[Killed] BlockStatement
src/modules/files/files.controller.ts:74:25
             const result = await filesService.deleteFile(fileName);
 
             return res.status(200).send(result);
-        } catch (error) {
-            console.error("Erro no handleDelete:", error);
-            return res.status(500).send({ error: "Erro interno ao deletar o arquivo." });
-        }
+        } catch (error) {}
     }
 }
killedBy: files routes DELETE /files/:fileName returns 500 when S3 delete fails
statusReason: expected 200 to be 500 // Object.is equality
