[Killed] BlockStatement
src/middlewares/auth.ts:19:54
   }
 }
 
-function isUserRole(role: unknown): role is UserRole {
-  return role === "OPERACIONAL" || role === "GERENTE";
-}
+function isUserRole(role: unknown): role is UserRole {}
 
 export async function verifyJWT(request: FastifyRequest, _reply: FastifyReply) {
killedBy: auth routes POST /auth/register returns 201 and creates a user
statusReason: expected 401 to be 201 // Object.is equality

[Killed] EqualityOperator
src/middlewares/auth.ts:20:10
 }
 
 function isUserRole(role: unknown): role is UserRole {
-  return role === "OPERACIONAL" || role === "GERENTE";
+  return role !== "OPERACIONAL" || role === "GERENTE";
 }
 
killedBy: auth routes POST /auth/register returns 403 when user role cannot register users
statusReason: expected 401 to be 403 // Object.is equality

[Killed] ConditionalExpression
src/middlewares/auth.ts:20:36
 }
 
 function isUserRole(role: unknown): role is UserRole {
-  return role === "OPERACIONAL" || role === "GERENTE";
+  return role === "OPERACIONAL" || false;
 }
 
killedBy: auth routes POST /auth/register returns 201 and creates a user
statusReason: expected 401 to be 201 // Object.is equality

[Killed] MethodExpression
src/middlewares/auth.ts:25:8
 
 export async function verifyJWT(request: FastifyRequest, _reply: FastifyReply) {
   const authorization = request.headers.authorization;
-  if (!authorization?.startsWith("Bearer ")) {
+  if (!authorization?.endsWith("Bearer ")) {
     throw new AppError("Token não informado", 401);
   }
killedBy: tags routes GET /tags returns 200 and a list of tags for GERENTE
statusReason: expected 401 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/middlewares/auth.ts:25:7
 
 export async function verifyJWT(request: FastifyRequest, _reply: FastifyReply) {
   const authorization = request.headers.authorization;
-  if (!authorization?.startsWith("Bearer ")) {
+  if (true) {
     throw new AppError("Token não informado", 401);
   }
killedBy: tags routes GET /tags returns 200 and a list of tags for GERENTE
statusReason: expected 401 to be 200 // Object.is equality

[Killed] StringLiteral
src/middlewares/auth.ts:26:24
 export async function verifyJWT(request: FastifyRequest, _reply: FastifyReply) {
   const authorization = request.headers.authorization;
   if (!authorization?.startsWith("Bearer ")) {
-    throw new AppError("Token não informado", 401);
+    throw new AppError("", 401);
   }
 
killedBy: auth routes POST /auth/register returns 401 when authorization token is missing
statusReason: expected { error: '' } to deeply equal { error: 'Token não informado' }

[Survived] MethodExpression
src/middlewares/auth.ts:29:17
     throw new AppError("Token não informado", 401);
   }
 
-  const token = authorization.replace("Bearer ", "").trim();
+  const token = authorization.replace("Bearer ", "");
   const jwtSecret = process.env.JWT_SECRET;
   if (!jwtSecret) {

[Killed] StringLiteral
src/middlewares/auth.ts:29:50
     throw new AppError("Token não informado", 401);
   }
 
-  const token = authorization.replace("Bearer ", "").trim();
+  const token = authorization.replace("Bearer ", "Stryker was here!").trim();
   const jwtSecret = process.env.JWT_SECRET;
   if (!jwtSecret) {
killedBy: RF-01 — Criação de Usuário (Blackbox) TC-RF01-01 - Gerente autenticado cadastrando novo Gerente com dados válidos
statusReason: expected 401 to be 201 // Object.is equality

[Killed] BooleanLiteral
src/middlewares/auth.ts:31:7
 
   const token = authorization.replace("Bearer ", "").trim();
   const jwtSecret = process.env.JWT_SECRET;
-  if (!jwtSecret) {
+  if (jwtSecret) {
     throw new Error("JWT_SECRET não configurado");
   }
killedBy: RF-01 — Criação de Usuário (Blackbox) TC-RF01-01 - Gerente autenticado cadastrando novo Gerente com dados válidos
statusReason: expected 500 to be 201 // Object.is equality

[Killed] BlockStatement
src/middlewares/auth.ts:31:19
 
   const token = authorization.replace("Bearer ", "").trim();
   const jwtSecret = process.env.JWT_SECRET;
-  if (!jwtSecret) {
-    throw new Error("JWT_SECRET não configurado");
-  }
+  if (!jwtSecret) {}
 
   try {
killedBy: auth routes POST /auth/register with missing JWT_SECRET returns 500 when JWT_SECRET is not configured
statusReason: expected 401 to be 500 // Object.is equality

[Survived] StringLiteral
src/middlewares/auth.ts:32:21
   const token = authorization.replace("Bearer ", "").trim();
   const jwtSecret = process.env.JWT_SECRET;
   if (!jwtSecret) {
-    throw new Error("JWT_SECRET não configurado");
+    throw new Error("");
   }
 

[Killed] BlockStatement
src/middlewares/auth.ts:35:7
     throw new Error("JWT_SECRET não configurado");
   }
 
-  try {
-    const decoded = jwt.verify(token, jwtSecret) as JwtPayload & {
-      email?: unknown;
-      role?: unknown;
-    };
-
-    const userId = Number(decoded.sub);
-    if (
-      !decoded.sub ||
-      Number.isNaN(userId) ||
-      typeof decoded.email !== "string" ||
-      !isUserRole(decoded.role)
-    ) {
-      throw new AppError("Token inválido", 401);
-    }
-
-    request.user = {
-      id: userId,
-      email: decoded.email,
-      role: decoded.role,
-    };
-  } catch (error) {
+  try {} catch (error) {
     if (error instanceof AppError) {
       throw error;
killedBy: RF-01 — Criação de Usuário (Blackbox) TC-RF01-01 - Gerente autenticado cadastrando novo Gerente com dados válidos
statusReason: expected 401 to be 201 // Object.is equality

[Killed] ConditionalExpression
src/middlewares/auth.ts:43:7
 
     const userId = Number(decoded.sub);
     if (
-      !decoded.sub ||
-      Number.isNaN(userId) ||
-      typeof decoded.email !== "string" ||
-      !isUserRole(decoded.role)
+      true
     ) {
       throw new AppError("Token inválido", 401);
killedBy: RF-01 — Criação de Usuário (Blackbox) TC-RF01-01 - Gerente autenticado cadastrando novo Gerente com dados válidos
statusReason: expected 401 to be 201 // Object.is equality

[Killed] LogicalOperator
src/middlewares/auth.ts:43:7
 
     const userId = Number(decoded.sub);
     if (
-      !decoded.sub ||
-      Number.isNaN(userId) ||
-      typeof decoded.email !== "string" ||
-      !isUserRole(decoded.role)
+      (!decoded.sub || Number.isNaN(userId) || typeof decoded.email !== "string") && !isUserRole(decoded.role)
     ) {
       throw new AppError("Token inválido", 401);
killedBy: clients routes POST /clients returns 401 when token has an unrecognized role
statusReason: expected 403 to be 401 // Object.is equality

[Killed] EqualityOperator
src/middlewares/auth.ts:45:7
     if (
       !decoded.sub ||
       Number.isNaN(userId) ||
-      typeof decoded.email !== "string" ||
+      typeof decoded.email === "string" ||
       !isUserRole(decoded.role)
     ) {
killedBy: RF-01 — Criação de Usuário (Blackbox) TC-RF01-01 - Gerente autenticado cadastrando novo Gerente com dados válidos
statusReason: expected 401 to be 201 // Object.is equality

[Survived] ConditionalExpression
src/middlewares/auth.ts:45:7
     if (
       !decoded.sub ||
       Number.isNaN(userId) ||
-      typeof decoded.email !== "string" ||
+      false ||
       !isUserRole(decoded.role)
     ) {

[Killed] BooleanLiteral
src/middlewares/auth.ts:46:7
       !decoded.sub ||
       Number.isNaN(userId) ||
       typeof decoded.email !== "string" ||
-      !isUserRole(decoded.role)
+      isUserRole(decoded.role)
     ) {
       throw new AppError("Token inválido", 401);
killedBy: RF-01 — Criação de Usuário (Blackbox) TC-RF01-01 - Gerente autenticado cadastrando novo Gerente com dados válidos
statusReason: expected 401 to be 201 // Object.is equality

[Killed] BlockStatement
src/middlewares/auth.ts:47:7
       Number.isNaN(userId) ||
       typeof decoded.email !== "string" ||
       !isUserRole(decoded.role)
-    ) {
-      throw new AppError("Token inválido", 401);
-    }
+    ) {}
 
     request.user = {
killedBy: tags routes POST /tags returns 401 for an unrecognized role
statusReason: expected 403 to be 401 // Object.is equality

[Survived] StringLiteral
src/middlewares/auth.ts:48:26
       typeof decoded.email !== "string" ||
       !isUserRole(decoded.role)
     ) {
-      throw new AppError("Token inválido", 401);
+      throw new AppError("", 401);
     }
 

[Killed] BlockStatement
src/middlewares/auth.ts:56:19
       email: decoded.email,
       role: decoded.role,
     };
-  } catch (error) {
-    if (error instanceof AppError) {
-      throw error;
-    }
-
-    throw new AppError("Token inválido", 401);
-  }
+  } catch (error) {}
 }
 
killedBy: auth routes POST /auth/register returns 401 when authorization token is invalid
statusReason: expected { error: 'Token não informado' } to deeply equal { error: 'Token inválido' }

[Killed] ConditionalExpression
src/middlewares/auth.ts:57:9
       role: decoded.role,
     };
   } catch (error) {
-    if (error instanceof AppError) {
+    if (true) {
       throw error;
     }
killedBy: auth routes POST /auth/register returns 401 when authorization token is invalid
statusReason: expected 500 to be 401 // Object.is equality

[Survived] BlockStatement
src/middlewares/auth.ts:57:36
       role: decoded.role,
     };
   } catch (error) {
-    if (error instanceof AppError) {
-      throw error;
-    }
+    if (error instanceof AppError) {}
 
     throw new AppError("Token inválido", 401);
