[Survived] LogicalOperator
src/modules/files/files.service.ts:7:26
 import { FastifyUploadFile, UploadResponse } from "./files.types";
 
 export class FilesService {
-    private bucketName = process.env.MINIO_BUCKET || "k3d-files";
+    private bucketName = process.env.MINIO_BUCKET && "k3d-files";
     private s3Client = getFilesClient();
 

[Survived] ConditionalExpression
src/modules/files/files.service.ts:7:26
 import { FastifyUploadFile, UploadResponse } from "./files.types";
 
 export class FilesService {
-    private bucketName = process.env.MINIO_BUCKET || "k3d-files";
+    private bucketName = true;
     private s3Client = getFilesClient();
 

[Survived] StringLiteral
src/modules/files/files.service.ts:11:32
     private s3Client = getFilesClient();
 
     async uploadFile(file: FastifyUploadFile): Promise<UploadResponse> {
-        const uniqueFileName = `${Date.now()}-${file.filename}`;
+        const uniqueFileName = ``;
 
         try {

[Killed] BlockStatement
src/modules/files/files.service.ts:13:13
     async uploadFile(file: FastifyUploadFile): Promise<UploadResponse> {
         const uniqueFileName = `${Date.now()}-${file.filename}`;
 
-        try {
-            console.log("Iniciando upload para o bucket:", this.bucketName);
-            console.log("Nome do arquivo:", uniqueFileName);
-            const uploadManager = new Upload({
-                client: this.s3Client,
-                params: {
-                    Bucket: this.bucketName,
-                    Key: uniqueFileName,
-                    Body: file.file,
-                    ContentType: file.mimetype,
-                },
-            });
-
-            console.log("Enviando stream para o MinIO...");
-            await uploadManager.done();
-            console.log("Upload concluído com sucesso!");
-
-            const fileUrl = `http://${process.env.MINIO_ENDPOINT}:9000/${this.bucketName}/${uniqueFileName}`;
-
-            return {
-                url: fileUrl,
-                fileName: uniqueFileName,
-                mimeType: file.mimetype,
-            };
-        } catch (error) {
+        try {} catch (error) {
             console.error("Erro ao fazer upload para o MinIO:", error);
             throw new Error("Não foi possível salvar o arquivo no servidor de armazenamento.");
killedBy: RF-17 — Upload de Arquivos 3D em Pedidos (Blackbox) TC-RF17-01 - Fazer upload de arquivo 'peca_suporte.stl' (5 MB) válido
statusReason: Unexpected end of JSON input

[Survived] StringLiteral
src/modules/files/files.service.ts:15:25
 
         try {
             console.log("Iniciando upload para o bucket:", this.bucketName);
-            console.log("Nome do arquivo:", uniqueFileName);
+            console.log("", uniqueFileName);
             const uploadManager = new Upload({
                 client: this.s3Client,

[Survived] ObjectLiteral
src/modules/files/files.service.ts:18:25
             console.log("Nome do arquivo:", uniqueFileName);
             const uploadManager = new Upload({
                 client: this.s3Client,
-                params: {
-                    Bucket: this.bucketName,
-                    Key: uniqueFileName,
-                    Body: file.file,
-                    ContentType: file.mimetype,
-                },
+                params: {},
             });
 

[Survived] StringLiteral
src/modules/files/files.service.ts:26:25
                 },
             });
 
-            console.log("Enviando stream para o MinIO...");
+            console.log("");
             await uploadManager.done();
             console.log("Upload concluído com sucesso!");

[Killed] BlockStatement
src/modules/files/files.service.ts:37:25
                 fileName: uniqueFileName,
                 mimeType: file.mimetype,
             };
-        } catch (error) {
-            console.error("Erro ao fazer upload para o MinIO:", error);
-            throw new Error("Não foi possível salvar o arquivo no servidor de armazenamento.");
-        }
+        } catch (error) {}
     }
     async getFile(fileName: string) {
killedBy: files routes POST /files returns 500 when upload driver fails
statusReason: expected 201 to be 500 // Object.is equality

[Survived] StringLiteral
src/modules/files/files.service.ts:39:29
             };
         } catch (error) {
             console.error("Erro ao fazer upload para o MinIO:", error);
-            throw new Error("Não foi possível salvar o arquivo no servidor de armazenamento.");
+            throw new Error("");
         }
     }

[Killed] BlockStatement
src/modules/files/files.service.ts:42:37
             throw new Error("Não foi possível salvar o arquivo no servidor de armazenamento.");
         }
     }
-    async getFile(fileName: string) {
-        try {
-            const command = new GetObjectCommand({
-                Bucket: this.bucketName,
-                Key: fileName,
-            });
-
-            const response = await this.s3Client.send(command);
-
-            if (!response.Body) {
-                throw new Error("Arquivo vazio ou não encontrado.");
-            }
-
-            return {
-                stream: response.Body,
-                contentType: response.ContentType || "application/octet-stream",
-            };
-        } catch (error) {
-            console.error(`Erro ao buscar o arquivo ${fileName} no MinIO:`, error);
-            throw new Error("Arquivo não encontrado no servidor de armazenamento.");
-        }
-    }
+    async getFile(fileName: string) {}
 
     async deleteFile(fileName: string): Promise<{ message: string }> {
killedBy: files routes GET /files/:fileName returns 200 and the file stream when file exists
statusReason: expected 404 to be 200 // Object.is equality

[Killed] BlockStatement
src/modules/files/files.service.ts:43:13
         }
     }
     async getFile(fileName: string) {
-        try {
-            const command = new GetObjectCommand({
-                Bucket: this.bucketName,
-                Key: fileName,
-            });
-
-            const response = await this.s3Client.send(command);
-
-            if (!response.Body) {
-                throw new Error("Arquivo vazio ou não encontrado.");
-            }
-
-            return {
-                stream: response.Body,
-                contentType: response.ContentType || "application/octet-stream",
-            };
-        } catch (error) {
+        try {} catch (error) {
             console.error(`Erro ao buscar o arquivo ${fileName} no MinIO:`, error);
             throw new Error("Arquivo não encontrado no servidor de armazenamento.");
killedBy: files routes GET /files/:fileName returns 200 and the file stream when file exists
statusReason: expected 404 to be 200 // Object.is equality

[Survived] ObjectLiteral
src/modules/files/files.service.ts:44:50
     }
     async getFile(fileName: string) {
         try {
-            const command = new GetObjectCommand({
-                Bucket: this.bucketName,
-                Key: fileName,
-            });
+            const command = new GetObjectCommand({});
 
             const response = await this.s3Client.send(command);

[Killed] ConditionalExpression
src/modules/files/files.service.ts:51:17
 
             const response = await this.s3Client.send(command);
 
-            if (!response.Body) {
+            if (true) {
                 throw new Error("Arquivo vazio ou não encontrado.");
             }
killedBy: files routes GET /files/:fileName returns 200 and the file stream when file exists
statusReason: expected 404 to be 200 // Object.is equality

[Killed] BooleanLiteral
src/modules/files/files.service.ts:51:17
 
             const response = await this.s3Client.send(command);
 
-            if (!response.Body) {
+            if (response.Body) {
                 throw new Error("Arquivo vazio ou não encontrado.");
             }
killedBy: files routes GET /files/:fileName returns 200 and the file stream when file exists
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/modules/files/files.service.ts:57:30
 
             return {
                 stream: response.Body,
-                contentType: response.ContentType || "application/octet-stream",
+                contentType: false,
             };
         } catch (error) {
killedBy: files routes GET /files/:fileName returns 200 and the file stream when file exists
statusReason: expected 500 to be 200 // Object.is equality

[Killed] LogicalOperator
src/modules/files/files.service.ts:57:30
 
             return {
                 stream: response.Body,
-                contentType: response.ContentType || "application/octet-stream",
+                contentType: response.ContentType && "application/octet-stream",
             };
         } catch (error) {
killedBy: files routes GET /files/:fileName returns 200 and the file stream when file exists
statusReason: expected 'application/octet-stream' to be 'image/png' // Object.is equality

[Survived] BlockStatement
src/modules/files/files.service.ts:59:25
                 stream: response.Body,
                 contentType: response.ContentType || "application/octet-stream",
             };
-        } catch (error) {
-            console.error(`Erro ao buscar o arquivo ${fileName} no MinIO:`, error);
-            throw new Error("Arquivo não encontrado no servidor de armazenamento.");
-        }
+        } catch (error) {}
     }
 

[Killed] BlockStatement
src/modules/files/files.service.ts:65:70
         }
     }
 
-    async deleteFile(fileName: string): Promise<{ message: string }> {
-        try {
-            const command = new DeleteObjectCommand({
-                Bucket: this.bucketName,
-                Key: fileName,
-            });
-
-            await this.s3Client.send(command);
-
-            return { message: `Arquivo ${fileName} deletado com sucesso.` };
-        } catch (error) {
-            console.error(`Erro ao deletar o arquivo ${fileName} no MinIO:`, error);
-            throw new Error("Não foi possível excluir o arquivo do servidor.");
-        }
-    }
+    async deleteFile(fileName: string): Promise<{ message: string }> {}
 }
 
killedBy: files routes DELETE /files/:fileName returns 200 when file is successfully deleted
statusReason: Unexpected end of JSON input

[Killed] BlockStatement
src/modules/files/files.service.ts:66:13
     }
 
     async deleteFile(fileName: string): Promise<{ message: string }> {
-        try {
-            const command = new DeleteObjectCommand({
-                Bucket: this.bucketName,
-                Key: fileName,
-            });
-
-            await this.s3Client.send(command);
-
-            return { message: `Arquivo ${fileName} deletado com sucesso.` };
-        } catch (error) {
+        try {} catch (error) {
             console.error(`Erro ao deletar o arquivo ${fileName} no MinIO:`, error);
             throw new Error("Não foi possível excluir o arquivo do servidor.");
killedBy: files routes DELETE /files/:fileName returns 200 when file is successfully deleted
statusReason: Unexpected end of JSON input

[Killed] BlockStatement
src/modules/files/files.service.ts:75:25
             await this.s3Client.send(command);
 
             return { message: `Arquivo ${fileName} deletado com sucesso.` };
-        } catch (error) {
-            console.error(`Erro ao deletar o arquivo ${fileName} no MinIO:`, error);
-            throw new Error("Não foi possível excluir o arquivo do servidor.");
-        }
+        } catch (error) {}
     }
 }
killedBy: files routes DELETE /files/:fileName returns 500 when S3 delete fails
statusReason: expected 200 to be 500 // Object.is equality

[Survived] StringLiteral
src/modules/files/files.service.ts:77:29
             return { message: `Arquivo ${fileName} deletado com sucesso.` };
         } catch (error) {
             console.error(`Erro ao deletar o arquivo ${fileName} no MinIO:`, error);
-            throw new Error("Não foi possível excluir o arquivo do servidor.");
+            throw new Error("");
         }
     }
