[Killed] BlockStatement
src/modules/order/order.service.ts:12:45
 import { paginatePrisma } from "../../utils/pagination";
 
 export class OrderService {
-  async createOrder(data: CreateOrderInput) {
-    const newOrder = await prisma.order.create({
-      data: {
-        title: data.title,
-        tagType: data.tagType,
-        archive: data.archive,
-        price: data.price,
-        amount_paid: data.amount_paid,
-        quantity: data.quantity,
-        payment_method: data.payment_method,
-        cost: data.cost,
-        clientId: data.client_id,
-        created_at: new Date(),
-        updated_at: new Date(),
-        section: data.section || "PENDENTE",
-        status: data.status || "NAO_PAGO",
-      },
-    });
-
-    return newOrder;
-  }
+  async createOrder(data: CreateOrderInput) {}
 
   async moveOrder(
killedBy: RF-17 — Upload de Arquivos 3D em Pedidos (Blackbox) TC-RF17-05 - Criar pedido sem arquivo anexado (upload não obrigatório)
statusReason: Unexpected end of JSON input

[Survived] LogicalOperator
src/modules/order/order.service.ts:26:18
         clientId: data.client_id,
         created_at: new Date(),
         updated_at: new Date(),
-        section: data.section || "PENDENTE",
+        section: data.section && "PENDENTE",
         status: data.status || "NAO_PAGO",
       },

[Survived] ConditionalExpression
src/modules/order/order.service.ts:26:18
         clientId: data.client_id,
         created_at: new Date(),
         updated_at: new Date(),
-        section: data.section || "PENDENTE",
+        section: false,
         status: data.status || "NAO_PAGO",
       },

[Survived] ConditionalExpression
src/modules/order/order.service.ts:27:17
         created_at: new Date(),
         updated_at: new Date(),
         section: data.section || "PENDENTE",
-        status: data.status || "NAO_PAGO",
+        status: false,
       },
     });

[Survived] LogicalOperator
src/modules/order/order.service.ts:27:17
         created_at: new Date(),
         updated_at: new Date(),
         section: data.section || "PENDENTE",
-        status: data.status || "NAO_PAGO",
+        status: data.status && "NAO_PAGO",
       },
     });

[Killed] BlockStatement
src/modules/order/order.service.ts:37:5
   async moveOrder(
     id: number,
     destinationSection: MoveOrderInput["destinationSection"],
-  ) {
-    const currentOrder = await prisma.order.findUnique({
-      where: { id: id },
-    });
-
-    if (!currentOrder) {
-      throw new Error("Pedido não encontrado.");
-    }
-
-    const movedOrder = await prisma.order.update({
-      where: { id: id },
-      data: { section: destinationSection },
-    });
-
-    return movedOrder;
-  }
+  ) {}
 
   async deleteOrder(id: number) {
killedBy: order routes (Kanban) PATCH /orders/:id/move returns 200 and moves the order on Kanban successfully
statusReason: Unexpected end of JSON input

[Survived] ObjectLiteral
src/modules/order/order.service.ts:38:56
     id: number,
     destinationSection: MoveOrderInput["destinationSection"],
   ) {
-    const currentOrder = await prisma.order.findUnique({
-      where: { id: id },
-    });
+    const currentOrder = await prisma.order.findUnique({});
 
     if (!currentOrder) {

[Killed] ConditionalExpression
src/modules/order/order.service.ts:42:9
       where: { id: id },
     });
 
-    if (!currentOrder) {
+    if (true) {
       throw new Error("Pedido não encontrado.");
     }
killedBy: RF-06 — Movimentação de Pedido entre Colunas do Kanban (Blackbox) TC-RF06-01 - Arrastar o card do pedido da seção 'A Fazer' (PENDENTE) para a seção 'Fazendo' (FAZENDO)
statusReason: expected 400 to be 200 // Object.is equality

[Killed] BlockStatement
src/modules/order/order.service.ts:42:24
       where: { id: id },
     });
 
-    if (!currentOrder) {
-      throw new Error("Pedido não encontrado.");
-    }
+    if (!currentOrder) {}
 
     const movedOrder = await prisma.order.update({
killedBy: order routes (Kanban) PATCH /orders/:id/move with invalid ID returns 400 when order is not found
statusReason: expected 200 to be 400 // Object.is equality

[Survived] StringLiteral
src/modules/order/order.service.ts:43:23
     });
 
     if (!currentOrder) {
-      throw new Error("Pedido não encontrado.");
+      throw new Error("");
     }
 

[Survived] ObjectLiteral
src/modules/order/order.service.ts:48:13
 
     const movedOrder = await prisma.order.update({
       where: { id: id },
-      data: { section: destinationSection },
+      data: {},
     });
 

[Killed] BlockStatement
src/modules/order/order.service.ts:54:33
     return movedOrder;
   }
 
-  async deleteOrder(id: number) {
-    const orderExists = await prisma.order.findUnique({
-      where: { id: id },
-    });
-
-    if (!orderExists) {
-      throw new Error("Pedido não encontrado.");
-    }
-
-    await prisma.order.delete({
-      where: { id: id },
-    });
-
-    return { message: "Pedido removido com sucesso do Kanban." };
-  }
+  async deleteOrder(id: number) {}
 
   async updateOrder(id: number, data: UpdateOrderInput) {
killedBy: order routes (Kanban) DELETE /orders/:id with invalid ID returns 400 when order is not found
statusReason: expected 200 to be 400 // Object.is equality

[Survived] ObjectLiteral
src/modules/order/order.service.ts:56:14
 
   async deleteOrder(id: number) {
     const orderExists = await prisma.order.findUnique({
-      where: { id: id },
+      where: {},
     });
 

[Killed] ConditionalExpression
src/modules/order/order.service.ts:59:9
       where: { id: id },
     });
 
-    if (!orderExists) {
+    if (false) {
       throw new Error("Pedido não encontrado.");
     }
killedBy: order routes (Kanban) DELETE /orders/:id with invalid ID returns 400 when order is not found
statusReason: expected 200 to be 400 // Object.is equality

[Killed] ConditionalExpression
src/modules/order/order.service.ts:59:9
       where: { id: id },
     });
 
-    if (!orderExists) {
+    if (true) {
       throw new Error("Pedido não encontrado.");
     }
killedBy: order routes (Kanban) DELETE /orders/:id TC-RF04-01 - returns 200 when order is successfully deleted
statusReason: expected 400 to be 200 // Object.is equality

[Survived] ObjectLiteral
src/modules/order/order.service.ts:63:31
       throw new Error("Pedido não encontrado.");
     }
 
-    await prisma.order.delete({
-      where: { id: id },
-    });
+    await prisma.order.delete({});
 
     return { message: "Pedido removido com sucesso do Kanban." };

[Survived] ObjectLiteral
src/modules/order/order.service.ts:67:12
       where: { id: id },
     });
 
-    return { message: "Pedido removido com sucesso do Kanban." };
+    return {};
   }
 

[Survived] StringLiteral
src/modules/order/order.service.ts:67:23
       where: { id: id },
     });
 
-    return { message: "Pedido removido com sucesso do Kanban." };
+    return { message: "" };
   }
 

[Survived] ObjectLiteral
src/modules/order/order.service.ts:71:56
   }
 
   async updateOrder(id: number, data: UpdateOrderInput) {
-    const currentOrder = await prisma.order.findUnique({
-      where: { id: id },
-    });
+    const currentOrder = await prisma.order.findUnique({});
 
     if (!currentOrder) {

[Survived] ObjectLiteral
src/modules/order/order.service.ts:72:14
 
   async updateOrder(id: number, data: UpdateOrderInput) {
     const currentOrder = await prisma.order.findUnique({
-      where: { id: id },
+      where: {},
     });
 

[Killed] ConditionalExpression
src/modules/order/order.service.ts:75:9
       where: { id: id },
     });
 
-    if (!currentOrder) {
+    if (false) {
       throw new Error("Pedido não encontrado.");
     }
killedBy: order routes (Kanban) PUT /orders/:id with invalid ID returns 400 when order is not found
statusReason: expected 200 to be 400 // Object.is equality

[Killed] BlockStatement
src/modules/order/order.service.ts:103:5
     page: number = 1,
     pageSize: number = 10,
     filters: Omit<GetOrderQueryInput, "page" | "pageSize"> = {},
-  ) {
-    const where = this.compileFilters(filters);
-
-    return paginatePrisma(
-      prisma.order,
-      {
-        where,
-        orderBy: { created_at: "desc" },
-        include: { client: true, tag: true },
-      },
-      { page, pageSize },
-    );
-  }
+  ) {}
 
   private compileFilters(filters: Record<string, any>): Prisma.OrderWhereInput {
killedBy: order routes (Kanban) GET /orders (Paginação e Filtros Dinâmicos) returns 200, paginated orders and correct metadata structure
statusReason: Unexpected end of JSON input

[Killed] ObjectLiteral
src/modules/order/order.service.ts:108:7
 
     return paginatePrisma(
       prisma.order,
-      {
-        where,
-        orderBy: { created_at: "desc" },
-        include: { client: true, tag: true },
-      },
+      {},
       { page, pageSize },
     );
killedBy: order routes (Kanban) GET /orders (Paginação e Filtros Dinâmicos) ignores properties that do not exist in database schema (campo_fantasma)
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining {"where": {}} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Survived] BooleanLiteral
src/modules/order/order.service.ts:111:39
       {
         where,
         orderBy: { created_at: "desc" },
-        include: { client: true, tag: true },
+        include: { client: true, tag: false },
       },
       { page, pageSize },

[Survived] BooleanLiteral
src/modules/order/order.service.ts:111:28
       {
         where,
         orderBy: { created_at: "desc" },
-        include: { client: true, tag: true },
+        include: { client: false, tag: true },
       },
       { page, pageSize },

[Survived] OptionalChaining
src/modules/order/order.service.ts:120:30
   private compileFilters(filters: Record<string, any>): Prisma.OrderWhereInput {
     const compiledWhere: Record<string, any> = {};
 
-    const fieldsDefinition = Prisma.dmmf.datamodel.models.find(
-      (m) => m.name === "Order",
-    )?.fields;
+    const fieldsDefinition = Prisma.dmmf.datamodel.models.find(m => m.name === "Order").fields;
 
     Object.entries(filters).forEach(([key, value]) => {

[Killed] EqualityOperator
src/modules/order/order.service.ts:121:14
     const compiledWhere: Record<string, any> = {};
 
     const fieldsDefinition = Prisma.dmmf.datamodel.models.find(
-      (m) => m.name === "Order",
+      (m) => m.name !== "Order",
     )?.fields;
 
killedBy: order routes (Kanban) GET /orders (Paginação e Filtros Dinâmicos) converte strings da URL para os tipos corretos (Int, Float) ao filtrar
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
src/modules/order/order.service.ts:121:14
     const compiledWhere: Record<string, any> = {};
 
     const fieldsDefinition = Prisma.dmmf.datamodel.models.find(
-      (m) => m.name === "Order",
+      (m) => true,
     )?.fields;
 
killedBy: order routes (Kanban) GET /orders (Paginação e Filtros Dinâmicos) converte strings da URL para os tipos corretos (Int, Float) ao filtrar
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] EqualityOperator
src/modules/order/order.service.ts:125:52
     )?.fields;
 
     Object.entries(filters).forEach(([key, value]) => {
-      if (value === undefined || value === null || value === "") return;
+      if (value === undefined || value === null || value !== "") return;
 
       const prismaField = key === "client_id" ? "clientId" : key;
killedBy: order routes (Kanban) GET /orders (Paginação e Filtros Dinâmicos) converte strings da URL para os tipos corretos (Int, Float) ao filtrar
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
src/modules/order/order.service.ts:125:11
     )?.fields;
 
     Object.entries(filters).forEach(([key, value]) => {
-      if (value === undefined || value === null || value === "") return;
+      if (false) return;
 
       const prismaField = key === "client_id" ? "clientId" : key;
killedBy: order routes (Kanban) GET /orders (Paginação e Filtros Dinâmicos) ignora filtros que venham com valores vazios ou nulos na URL
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining {"where": {}} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] EqualityOperator
src/modules/order/order.service.ts:127:27
     Object.entries(filters).forEach(([key, value]) => {
       if (value === undefined || value === null || value === "") return;
 
-      const prismaField = key === "client_id" ? "clientId" : key;
+      const prismaField = key !== "client_id" ? "clientId" : key;
       const fieldInfo = fieldsDefinition?.find((f) => f.name === prismaField);
       if (!fieldInfo) return;
killedBy: order routes (Kanban) GET /orders (Paginação e Filtros Dinâmicos) converte strings da URL para os tipos corretos (Int, Float) ao filtrar
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
src/modules/order/order.service.ts:127:27
     Object.entries(filters).forEach(([key, value]) => {
       if (value === undefined || value === null || value === "") return;
 
-      const prismaField = key === "client_id" ? "clientId" : key;
+      const prismaField = true ? "clientId" : key;
       const fieldInfo = fieldsDefinition?.find((f) => f.name === prismaField);
       if (!fieldInfo) return;
killedBy: order routes (Kanban) GET /orders (Paginação e Filtros Dinâmicos) converte strings da URL para os tipos corretos (Int, Float) ao filtrar
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] EqualityOperator
src/modules/order/order.service.ts:128:55
       if (value === undefined || value === null || value === "") return;
 
       const prismaField = key === "client_id" ? "clientId" : key;
-      const fieldInfo = fieldsDefinition?.find((f) => f.name === prismaField);
+      const fieldInfo = fieldsDefinition?.find((f) => f.name !== prismaField);
       if (!fieldInfo) return;
 
killedBy: order routes (Kanban) GET /orders with different filter types filters by title using case-insensitive contains
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
src/modules/order/order.service.ts:128:55
       if (value === undefined || value === null || value === "") return;
 
       const prismaField = key === "client_id" ? "clientId" : key;
-      const fieldInfo = fieldsDefinition?.find((f) => f.name === prismaField);
+      const fieldInfo = fieldsDefinition?.find((f) => false);
       if (!fieldInfo) return;
 
killedBy: order routes (Kanban) GET /orders (Paginação e Filtros Dinâmicos) converte strings da URL para os tipos corretos (Int, Float) ao filtrar
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BooleanLiteral
src/modules/order/order.service.ts:129:11
 
       const prismaField = key === "client_id" ? "clientId" : key;
       const fieldInfo = fieldsDefinition?.find((f) => f.name === prismaField);
-      if (!fieldInfo) return;
+      if (fieldInfo) return;
 
       const strategy: Record<string, () => void> = {
killedBy: order routes (Kanban) GET /orders (Paginação e Filtros Dinâmicos) converte strings da URL para os tipos corretos (Int, Float) ao filtrar
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
src/modules/order/order.service.ts:129:11
 
       const prismaField = key === "client_id" ? "clientId" : key;
       const fieldInfo = fieldsDefinition?.find((f) => f.name === prismaField);
-      if (!fieldInfo) return;
+      if (true) return;
 
       const strategy: Record<string, () => void> = {
killedBy: order routes (Kanban) GET /orders (Paginação e Filtros Dinâmicos) converte strings da URL para os tipos corretos (Int, Float) ao filtrar
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
src/modules/order/order.service.ts:132:23
       if (!fieldInfo) return;
 
       const strategy: Record<string, () => void> = {
-        String: () => {
-          compiledWhere[prismaField] =
-            prismaField === "title"
-              ? { contains: value, mode: "insensitive" }
-              : value;
-        },
+        String: () => {},
         Int: () => {
           compiledWhere[prismaField] = Number(value);
killedBy: order routes (Kanban) GET /orders with different filter types filters by title using case-insensitive contains
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
src/modules/order/order.service.ts:134:13
       const strategy: Record<string, () => void> = {
         String: () => {
           compiledWhere[prismaField] =
-            prismaField === "title"
+            false
               ? { contains: value, mode: "insensitive" }
               : value;
killedBy: order routes (Kanban) GET /orders with different filter types filters by title using case-insensitive contains
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] EqualityOperator
src/modules/order/order.service.ts:134:13
       const strategy: Record<string, () => void> = {
         String: () => {
           compiledWhere[prismaField] =
-            prismaField === "title"
+            prismaField !== "title"
               ? { contains: value, mode: "insensitive" }
               : value;
killedBy: order routes (Kanban) GET /orders with different filter types filters by title using case-insensitive contains
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
src/modules/order/order.service.ts:138:20
               ? { contains: value, mode: "insensitive" }
               : value;
         },
-        Int: () => {
-          compiledWhere[prismaField] = Number(value);
-        },
+        Int: () => {},
         Float: () => {
           compiledWhere[prismaField] = Number(value);
killedBy: order routes (Kanban) GET /orders (Paginação e Filtros Dinâmicos) converte strings da URL para os tipos corretos (Int, Float) ao filtrar
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
src/modules/order/order.service.ts:141:22
         Int: () => {
           compiledWhere[prismaField] = Number(value);
         },
-        Float: () => {
-          compiledWhere[prismaField] = Number(value);
-        },
+        Float: () => {},
         Boolean: () => {
           compiledWhere[prismaField] = value === "true" || value === true;
killedBy: order routes (Kanban) GET /orders (Paginação e Filtros Dinâmicos) converte strings da URL para os tipos corretos (Int, Float) ao filtrar
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[NoCoverage] BlockStatement
src/modules/order/order.service.ts:144:24
         Float: () => {
           compiledWhere[prismaField] = Number(value);
         },
-        Boolean: () => {
-          compiledWhere[prismaField] = value === "true" || value === true;
-        },
+        Boolean: () => {},
         enum: () => {
           compiledWhere[prismaField] = value;

[NoCoverage] EqualityOperator
src/modules/order/order.service.ts:145:40
           compiledWhere[prismaField] = Number(value);
         },
         Boolean: () => {
-          compiledWhere[prismaField] = value === "true" || value === true;
+          compiledWhere[prismaField] = value !== "true" || value === true;
         },
         enum: () => {

[NoCoverage] EqualityOperator
src/modules/order/order.service.ts:145:60
           compiledWhere[prismaField] = Number(value);
         },
         Boolean: () => {
-          compiledWhere[prismaField] = value === "true" || value === true;
+          compiledWhere[prismaField] = value === "true" || value !== true;
         },
         enum: () => {

[Killed] BlockStatement
src/modules/order/order.service.ts:147:21
         Boolean: () => {
           compiledWhere[prismaField] = value === "true" || value === true;
         },
-        enum: () => {
-          compiledWhere[prismaField] = value;
-        },
+        enum: () => {},
       };
 
killedBy: order routes (Kanban) GET /orders with different filter types filters by non-title string field with exact match
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
src/modules/order/order.service.ts:152:23
         },
       };
 
-      const execute = strategy[fieldInfo.type] || strategy[fieldInfo.kind];
+      const execute = false;
       if (execute) execute();
     });
killedBy: order routes (Kanban) GET /orders (Paginação e Filtros Dinâmicos) converte strings da URL para os tipos corretos (Int, Float) ao filtrar
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
src/modules/order/order.service.ts:152:23
         },
       };
 
-      const execute = strategy[fieldInfo.type] || strategy[fieldInfo.kind];
+      const execute = true;
       if (execute) execute();
     });
killedBy: order routes (Kanban) GET /orders (Paginação e Filtros Dinâmicos) returns 200, paginated orders and correct metadata structure
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/modules/order/order.service.ts:153:11
       };
 
       const execute = strategy[fieldInfo.type] || strategy[fieldInfo.kind];
-      if (execute) execute();
+      if (false) execute();
     });
 
killedBy: order routes (Kanban) GET /orders (Paginação e Filtros Dinâmicos) converte strings da URL para os tipos corretos (Int, Float) ao filtrar
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Survived] ConditionalExpression
src/modules/order/order.service.ts:153:11
       };
 
       const execute = strategy[fieldInfo.type] || strategy[fieldInfo.kind];
-      if (execute) execute();
+      if (true) execute();
     });
 
