[Killed] BlockStatement
src/middlewares/rbac.ts:5:53
 import { AppError } from "../utils/errors";
 import { UserRole } from "./auth";
 
-export function checkRole(allowedRoles: UserRole[]) {
-
-  return async function roleGuard(
-    request: FastifyRequest,
-    _reply: FastifyReply,
-  ) {
-
-    if (!request.user) {
-      throw new AppError("Token não informado", 401);
-    }
-
-    if (!allowedRoles.includes(request.user.role)) {
-      throw new AppError("Acesso negado", 403);
-    }
-  };
-}
+export function checkRole(allowedRoles: UserRole[]) {}
 
killedBy: RF-01 — Criação de Usuário (Blackbox) TC-RF01-01 - Gerente autenticado cadastrando novo Gerente com dados válidos
statusReason: preHandler hook should be a function, instead got [object Undefined]

[Killed] BlockStatement
src/middlewares/rbac.ts:10:5
   return async function roleGuard(
     request: FastifyRequest,
     _reply: FastifyReply,
-  ) {
-
-    if (!request.user) {
-      throw new AppError("Token não informado", 401);
-    }
-
-    if (!allowedRoles.includes(request.user.role)) {
-      throw new AppError("Acesso negado", 403);
-    }
-  };
+  ) {};
 }
 
killedBy: RF-14 — Controle de Acesso por Perfil (Blackbox) TC-RF14-02 - Usuário Operacional tem acesso negado à Calculadora
statusReason: expected 200 to be 403 // Object.is equality

[Killed] ConditionalExpression
src/middlewares/rbac.ts:12:9
     _reply: FastifyReply,
   ) {
 
-    if (!request.user) {
+    if (false) {
       throw new AppError("Token não informado", 401);
     }
killedBy: auth routes rbac middleware throws 401 when request.user is not set
statusReason: expected [Function] to throw error including 'Token não informado' but got 'Cannot read properties of undefined (…'

[Killed] ConditionalExpression
src/middlewares/rbac.ts:12:9
     _reply: FastifyReply,
   ) {
 
-    if (!request.user) {
+    if (true) {
       throw new AppError("Token não informado", 401);
     }
killedBy: RF-01 — Criação de Usuário (Blackbox) TC-RF01-01 - Gerente autenticado cadastrando novo Gerente com dados válidos
statusReason: expected 401 to be 201 // Object.is equality

[Killed] StringLiteral
src/middlewares/rbac.ts:13:26
   ) {
 
     if (!request.user) {
-      throw new AppError("Token não informado", 401);
+      throw new AppError("", 401);
     }
 
killedBy: auth routes rbac middleware throws 401 when request.user is not set
statusReason: expected [Function] to throw error including 'Token não informado' but got ''

[Killed] BooleanLiteral
src/middlewares/rbac.ts:16:9
       throw new AppError("Token não informado", 401);
     }
 
-    if (!allowedRoles.includes(request.user.role)) {
+    if (allowedRoles.includes(request.user.role)) {
       throw new AppError("Acesso negado", 403);
     }
killedBy: RF-01 — Criação de Usuário (Blackbox) TC-RF01-01 - Gerente autenticado cadastrando novo Gerente com dados válidos
statusReason: expected 403 to be 201 // Object.is equality

[Killed] ConditionalExpression
src/middlewares/rbac.ts:16:9
       throw new AppError("Token não informado", 401);
     }
 
-    if (!allowedRoles.includes(request.user.role)) {
+    if (true) {
       throw new AppError("Acesso negado", 403);
     }
killedBy: RF-01 — Criação de Usuário (Blackbox) TC-RF01-01 - Gerente autenticado cadastrando novo Gerente com dados válidos
statusReason: expected 403 to be 201 // Object.is equality

[Killed] StringLiteral
src/middlewares/rbac.ts:17:26
     }
 
     if (!allowedRoles.includes(request.user.role)) {
-      throw new AppError("Acesso negado", 403);
+      throw new AppError("", 403);
     }
   };
killedBy: auth routes POST /auth/register returns 403 when user role cannot register users
statusReason: expected { error: '' } to deeply equal { error: 'Acesso negado' }
