[Killed] BlockStatement
src/utils/errors.ts:8:69
   public readonly statusCode: number;
   public readonly details?: unknown;
 
-  constructor(message: string, statusCode = 400, details?: unknown) {
-    super(message);
-    this.statusCode = statusCode;
-    this.details = details;
-    this.name = "AppError";
-
-    Object.setPrototypeOf(this, AppError.prototype);
-  }
+  constructor(message: string, statusCode = 400, details?: unknown) {}
 }
 
killedBy: tags routes GET /tags returns 401 when token is missing
statusReason: expected 500 to be 401 // Object.is equality

[Killed] BlockStatement
src/utils/errors.ts:22:3
   error: Error,
   request: FastifyRequest,
   reply: FastifyReply,
-) {
-  if (error instanceof ZodError) {
-    return reply.status(400).send({
-      error: "Dados inválidos",
-      details: error.errors,
-    });
-  }
-
-  if (error instanceof AppError) {
-    return reply.status(error.statusCode).send({
-      error: error.message,
-      ...(error.details ? { details: error.details } : {}),
-    });
-  }
-
-  request.log.error(error);
-
-  return reply.status(500).send({
-    error: "Erro interno do servidor",
-  });
-}
+) {}
 
killedBy: tags routes GET /tags returns 401 when token is missing
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/utils/errors.ts:23:7
   request: FastifyRequest,
   reply: FastifyReply,
 ) {
-  if (error instanceof ZodError) {
+  if (true) {
     return reply.status(400).send({
       error: "Dados inválidos",
killedBy: tags routes GET /tags returns 401 when token is missing
statusReason: expected 400 to be 401 // Object.is equality

[Killed] ConditionalExpression
src/utils/errors.ts:23:7
   request: FastifyRequest,
   reply: FastifyReply,
 ) {
-  if (error instanceof ZodError) {
+  if (false) {
     return reply.status(400).send({
       error: "Dados inválidos",
killedBy: tags routes GET /tags/:id returns 400 when id is not numeric
statusReason: expected 500 to be 400 // Object.is equality

[Killed] ObjectLiteral
src/utils/errors.ts:24:35
   reply: FastifyReply,
 ) {
   if (error instanceof ZodError) {
-    return reply.status(400).send({
-      error: "Dados inválidos",
-      details: error.errors,
-    });
+    return reply.status(400).send({});
   }
 
killedBy: tags routes GET /tags/:id returns 400 when id is not numeric
statusReason: expected {} to match object { error: 'Dados inválidos' }

[Killed] ConditionalExpression
src/utils/errors.ts:30:7
     });
   }
 
-  if (error instanceof AppError) {
+  if (true) {
     return reply.status(error.statusCode).send({
       error: error.message,
killedBy: tags routes PATCH /tags/:id returns 500 when update fails with a non-unique-constraint error
statusReason: expected { statusCode: 500, …(3) } to deeply equal { error: 'Erro interno do servidor' }

[Killed] ConditionalExpression
src/utils/errors.ts:30:7
     });
   }
 
-  if (error instanceof AppError) {
+  if (false) {
     return reply.status(error.statusCode).send({
       error: error.message,
killedBy: auth routes POST /auth/register returns 401 when authorization token is missing
statusReason: expected 500 to be 401 // Object.is equality

[Killed] ObjectLiteral
src/utils/errors.ts:31:48
   }
 
   if (error instanceof AppError) {
-    return reply.status(error.statusCode).send({
-      error: error.message,
-      ...(error.details ? { details: error.details } : {}),
-    });
+    return reply.status(error.statusCode).send({});
   }
 
killedBy: auth routes POST /auth/register returns 401 when authorization token is missing
statusReason: expected {} to deeply equal { error: 'Token não informado' }
