[Killed] BlockStatement
src/modules/auth/auth.routes.ts:6:56
 import { verifyJWT } from "../../middlewares/auth";
 import { checkRole } from "../../middlewares/rbac";
 
-export async function authRoutes(app: FastifyInstance) {
-
-  app.post(
-    "/register",
-    {
-      preHandler: [verifyJWT, checkRole(["GERENTE"])],
-    },
-    AuthController.registerHandler,
-  );
-
-  app.post(
-    "/login",
-     AuthController.loginHandler);
-}
+export async function authRoutes(app: FastifyInstance) {}
 
killedBy: RF-01 — Criação de Usuário (Blackbox) TC-RF01-01 - Gerente autenticado cadastrando novo Gerente com dados válidos
statusReason: expected 404 to be 201 // Object.is equality

[Killed] StringLiteral
src/modules/auth/auth.routes.ts:11:42
   app.post(
     "/register",
     {
-      preHandler: [verifyJWT, checkRole(["GERENTE"])],
+      preHandler: [verifyJWT, checkRole([""])],
     },
     AuthController.registerHandler,
killedBy: RF-01 — Criação de Usuário (Blackbox) TC-RF01-01 - Gerente autenticado cadastrando novo Gerente com dados válidos
statusReason: expected 403 to be 201 // Object.is equality

[Killed] ArrayDeclaration
src/modules/auth/auth.routes.ts:11:41
   app.post(
     "/register",
     {
-      preHandler: [verifyJWT, checkRole(["GERENTE"])],
+      preHandler: [verifyJWT, checkRole([])],
     },
     AuthController.registerHandler,
killedBy: RF-01 — Criação de Usuário (Blackbox) TC-RF01-01 - Gerente autenticado cadastrando novo Gerente com dados válidos
statusReason: expected 403 to be 201 // Object.is equality

[Killed] StringLiteral
src/modules/auth/auth.routes.ts:17:5
   );
 
   app.post(
-    "/login",
+    "",
      AuthController.loginHandler);
 }
killedBy: RF-02 — Login de Usuário (Blackbox) TC-RF02-05 - Impedir login com campos de usuário e senha em branco
statusReason: expected 404 to be 400 // Object.is equality
