[Killed] BlockStatement
src/modules/calculator/calculator.controller.ts:7:88
 
 export class CalculatorController {
     
-    static async updateParametersHandler(request: FastifyRequest, reply: FastifyReply) {
-        const data = calculatorParameterSchema.parse(request.body);
-        const updated = await CalculatorService.updateParameters(data);
-        
-        return reply.status(200).send({
-        message: "Parâmetros configurados e salvos com sucesso!",
-        data: updated,
-        });
-    }
+    static async updateParametersHandler(request: FastifyRequest, reply: FastifyReply) {}
 
     static async getParametersHandler(request: FastifyRequest, reply: FastifyReply) {
killedBy: RF-09 — Configuração de Parâmetros da Calculadora (Blackbox) TC-RF09-01 - Salvar parâmetros da calculadora com dados válidos
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/modules/calculator/calculator.controller.ts:17:85
         });
     }
 
-    static async getParametersHandler(request: FastifyRequest, reply: FastifyReply) {
-    const parameters = await CalculatorService.getParameters();
-    return reply.status(200).send(parameters);
-  }
+    static async getParametersHandler(request: FastifyRequest, reply: FastifyReply) {}
 
     static async calculateHandler(request: FastifyRequest, reply: FastifyReply) {
killedBy: calculator routes GET /calculator/parameters returns 200 and the current parameters for GERENTE
statusReason: Unexpected end of JSON input

[Killed] BlockStatement
src/modules/calculator/calculator.controller.ts:22:81
     return reply.status(200).send(parameters);
   }
 
-    static async calculateHandler(request: FastifyRequest, reply: FastifyReply) {
-        const data = calculateCostSchema.parse(request.body);
-        const result = await CalculatorService.calculate(data);
-        return reply.status(200).send(result);
-    }
+    static async calculateHandler(request: FastifyRequest, reply: FastifyReply) {}
 }
killedBy: calculator routes POST /calculator/calculate returns 200 and calculates total cost and suggested price correctly
statusReason: Unexpected end of JSON input
