[Killed] BlockStatement
src/modules/auth/auth.service.ts:12:21
     const userExists = await prisma.user.findUnique({
       where: { email: data.email },
     });
-    if (userExists) {
-      throw new AppError("E-mail já cadastrado!", 409);
-    }
+    if (userExists) {}
 
     const password_hash = await bcrypt.hash(data.password, 10);
killedBy: RF-01 — Criação de Usuário (Blackbox) TC-RF01-05 - Impedir cadastro com e-mail duplicado
statusReason: expected 500 to be 409 // Object.is equality

[Killed] ConditionalExpression
src/modules/auth/auth.service.ts:12:9
     const userExists = await prisma.user.findUnique({
       where: { email: data.email },
     });
-    if (userExists) {
+    if (false) {
       throw new AppError("E-mail já cadastrado!", 409);
     }
killedBy: RF-01 — Criação de Usuário (Blackbox) TC-RF01-05 - Impedir cadastro com e-mail duplicado
statusReason: expected 201 to be 409 // Object.is equality

[Killed] ObjectLiteral
src/modules/auth/auth.service.ts:18:46
 
     const password_hash = await bcrypt.hash(data.password, 10);
 
-    const newUser = await prisma.user.create({
-      data: {
-        name: data.name,
-        email: data.email,
-        password_hash,
-        role: data.role,
-        created_at: new Date(),
-      },
-    });
+    const newUser = await prisma.user.create({});
 
     return {
killedBy: auth routes POST /auth/register returns 201 and creates a user
statusReason: expected "vi.fn()" to be called with arguments: [ { data: ObjectContaining{…} } ]

Received:

  1st vi.fn() call:

  [
-   {

[Killed] ObjectLiteral
src/modules/auth/auth.service.ts:29:13
     });
 
     return {
-      user: {
-        id: newUser.id,
-        name: newUser.name,
-        email: newUser.email,
-        role: newUser.role,
-        createdAt: newUser.created_at,
-      },
+      user: {},
     };
   }
killedBy: auth routes POST /auth/register returns 201 and creates a user
statusReason: expected { user: {} } to match object { user: { id: 10, …(3) } }

[Killed] BlockStatement
src/modules/auth/auth.service.ts:42:16
   static async login(data: LoginInput) {
     const user = await prisma.user.findUnique({ where: { email: data.email } });
 
-    if (!user) {
-      throw new AppError("Credenciais inválidas", 401);
-    }
+    if (!user) {}
 
     const passwordMatches = await bcrypt.compare(
killedBy: auth routes POST /auth/login TC-RF02-04 - returns 401 for unknown user
statusReason: expected 500 to be 401 // Object.is equality

[Killed] StringLiteral
src/modules/auth/auth.service.ts:43:26
     const user = await prisma.user.findUnique({ where: { email: data.email } });
 
     if (!user) {
-      throw new AppError("Credenciais inválidas", 401);
+      throw new AppError("", 401);
     }
 
killedBy: auth routes POST /auth/login TC-RF02-04 - returns 401 for unknown user
statusReason: expected { error: '' } to deeply equal { error: 'Credenciais inválidas' }

[Killed] BooleanLiteral
src/modules/auth/auth.service.ts:51:9
       user.password_hash,
     );
 
-    if (!passwordMatches) {
+    if (passwordMatches) {
       throw new AppError("Credenciais inválidas", 401);
     }
killedBy: auth routes POST /auth/login TC-RF02-01 / TC-RF02-02 - returns 200, a JWT token, and user data for valid credentials
statusReason: jwt must be provided

[Killed] ConditionalExpression
src/modules/auth/auth.service.ts:51:9
       user.password_hash,
     );
 
-    if (!passwordMatches) {
+    if (true) {
       throw new AppError("Credenciais inválidas", 401);
     }
killedBy: auth routes POST /auth/login TC-RF02-01 / TC-RF02-02 - returns 200, a JWT token, and user data for valid credentials
statusReason: jwt must be provided

[Killed] ConditionalExpression
src/modules/auth/auth.service.ts:56:9
     }
 
     const jwtSecret = process.env.JWT_SECRET;
-    if (!jwtSecret) {
+    if (true) {
       throw new Error("JWT_SECRET não configurado");
     }
killedBy: auth routes POST /auth/login TC-RF02-01 / TC-RF02-02 - returns 200, a JWT token, and user data for valid credentials
statusReason: jwt must be provided

[Killed] ObjectLiteral
src/modules/auth/auth.service.ts:73:7
         role: user.role,
       },
       jwtSecret,
-      {
-        ...signOptions,
-        subject: String(user.id),
-      },
+      {},
     );
 
killedBy: auth routes POST /auth/login TC-RF02-01 / TC-RF02-02 - returns 200, a JWT token, and user data for valid credentials
statusReason: expected { email: 'user@email.com', …(2) } to match object { sub: '1', …(2) }
(1 matching property omitted from actual)

[Killed] ObjectLiteral
src/modules/auth/auth.service.ts:79:12
       },
     );
 
-    return {
-      token,
-      user: {
-        id: user.id,
-        name: user.name,
-        email: user.email,
-        role: user.role,
-      },
-    };
+    return {};
   }
 }
killedBy: auth routes POST /auth/login TC-RF02-01 / TC-RF02-02 - returns 200, a JWT token, and user data for valid credentials
statusReason: jwt must be provided

[Killed] ObjectLiteral
src/modules/auth/auth.service.ts:81:13
 
     return {
       token,
-      user: {
-        id: user.id,
-        name: user.name,
-        email: user.email,
-        role: user.role,
-      },
+      user: {},
     };
   }
killedBy: auth routes POST /auth/login TC-RF02-01 / TC-RF02-02 - returns 200, a JWT token, and user data for valid credentials
statusReason: expected { …(2) } to match object { token: Any<String>, …(1) }
