[Killed] BlockStatement
src/modules/calculator/calculator.routes.ts:6:62
 import { verifyJWT } from "../../middlewares/auth";
 import { checkRole } from "../../middlewares/rbac";
 
-export async function calculatorRoutes(app: FastifyInstance) {
-  app.addHook("preHandler", verifyJWT);
-
-  app.post(
-    "/parameters",
-    { preHandler: [checkRole(["GERENTE"])] },
-    CalculatorController.updateParametersHandler
-  );
-
-  app.get(
-    "/parameters",
-    { preHandler: [checkRole(["GERENTE"])] },
-    CalculatorController.getParametersHandler
-  );
-
-  app.post(
-    "/calculate",
-    { preHandler: [checkRole(["GERENTE"])] },
-    CalculatorController.calculateHandler
-  );
-}
+export async function calculatorRoutes(app: FastifyInstance) {}
killedBy: calculator routes GET /calculator/parameters returns 200 and the current parameters for GERENTE
statusReason: expected 404 to be 200 // Object.is equality

[Killed] StringLiteral
src/modules/calculator/calculator.routes.ts:11:31
 
   app.post(
     "/parameters",
-    { preHandler: [checkRole(["GERENTE"])] },
+    { preHandler: [checkRole([""])] },
     CalculatorController.updateParametersHandler
   );
killedBy: calculator routes POST /calculator/parameters returns 200, creates new parameters when none exist and confirms saving
statusReason: expected 403 to be 200 // Object.is equality

[Killed] ArrayDeclaration
src/modules/calculator/calculator.routes.ts:11:30
 
   app.post(
     "/parameters",
-    { preHandler: [checkRole(["GERENTE"])] },
+    { preHandler: [checkRole([])] },
     CalculatorController.updateParametersHandler
   );
killedBy: calculator routes POST /calculator/parameters returns 200, creates new parameters when none exist and confirms saving
statusReason: expected 403 to be 200 // Object.is equality

[Killed] StringLiteral
src/modules/calculator/calculator.routes.ts:16:5
   );
 
   app.get(
-    "/parameters",
+    "",
     { preHandler: [checkRole(["GERENTE"])] },
     CalculatorController.getParametersHandler
killedBy: calculator routes GET /calculator/parameters returns 200 and the current parameters for GERENTE
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ArrayDeclaration
src/modules/calculator/calculator.routes.ts:17:19
 
   app.get(
     "/parameters",
-    { preHandler: [checkRole(["GERENTE"])] },
+    { preHandler: [] },
     CalculatorController.getParametersHandler
   );
killedBy: calculator routes GET /calculator/parameters returns 403 Forbidden for OPERACIONAL profile
statusReason: expected 200 to be 403 // Object.is equality

[Killed] ObjectLiteral
src/modules/calculator/calculator.routes.ts:23:5
 
   app.post(
     "/calculate",
-    { preHandler: [checkRole(["GERENTE"])] },
+    {},
     CalculatorController.calculateHandler
   );
killedBy: calculator routes POST /calculator/calculate returns 403 Forbidden for OPERACIONAL profile
statusReason: expected 200 to be 403 // Object.is equality
