[Killed] BlockStatement
src/modules/calculator/calculator.service.ts:6:65
 import { CalculateCostInput, CalculatorParameterInput } from "./calculator.types";
 
 export class CalculatorService {
-  static async updateParameters(data: CalculatorParameterInput) {
-    const currentParam = await prisma.calculatorParameter.findFirst();
-
-    if (currentParam) {
-      return await prisma.calculatorParameter.update({
-        where: { id: currentParam.id },
-        data,
-      });
-    }
-
-    return await prisma.calculatorParameter.create({
-      data,
-    });
-  }
+  static async updateParameters(data: CalculatorParameterInput) {}
 
   static async getParameters() {
killedBy: calculator routes POST /calculator/parameters returns 200, creates new parameters when none exist and confirms saving
statusReason: expected undefined to match object { filament_price: 120, …(3) }

[Killed] ConditionalExpression
src/modules/calculator/calculator.service.ts:9:9
   static async updateParameters(data: CalculatorParameterInput) {
     const currentParam = await prisma.calculatorParameter.findFirst();
 
-    if (currentParam) {
+    if (false) {
       return await prisma.calculatorParameter.update({
         where: { id: currentParam.id },
killedBy: calculator routes POST /calculator/parameters returns 200 and updates parameters when they already exist
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
src/modules/calculator/calculator.service.ts:9:23
   static async updateParameters(data: CalculatorParameterInput) {
     const currentParam = await prisma.calculatorParameter.findFirst();
 
-    if (currentParam) {
-      return await prisma.calculatorParameter.update({
-        where: { id: currentParam.id },
-        data,
-      });
-    }
+    if (currentParam) {}
 
     return await prisma.calculatorParameter.create({
killedBy: calculator routes POST /calculator/parameters returns 200 and updates parameters when they already exist
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
src/modules/calculator/calculator.service.ts:21:32
     });
   }
 
-  static async getParameters() {
-    const parameters = await prisma.calculatorParameter.findFirst();
-    if (!parameters) {
-      throw new AppError("Parâmetros da calculadora não configurados pelo Gerente.", 404);
-    }
-    return parameters;
-  }
+  static async getParameters() {}
 
   static async calculate(input: CalculateCostInput) {
killedBy: calculator routes GET /calculator/parameters returns 200 and the current parameters for GERENTE
statusReason: Unexpected end of JSON input

[Killed] BooleanLiteral
src/modules/calculator/calculator.service.ts:23:9
 
   static async getParameters() {
     const parameters = await prisma.calculatorParameter.findFirst();
-    if (!parameters) {
+    if (parameters) {
       throw new AppError("Parâmetros da calculadora não configurados pelo Gerente.", 404);
     }
killedBy: calculator routes GET /calculator/parameters returns 200 and the current parameters for GERENTE
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/modules/calculator/calculator.service.ts:23:9
 
   static async getParameters() {
     const parameters = await prisma.calculatorParameter.findFirst();
-    if (!parameters) {
+    if (true) {
       throw new AppError("Parâmetros da calculadora não configurados pelo Gerente.", 404);
     }
killedBy: calculator routes GET /calculator/parameters returns 200 and the current parameters for GERENTE
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/modules/calculator/calculator.service.ts:32:9
   static async calculate(input: CalculateCostInput) {
     const parameters = await prisma.calculatorParameter.findFirst();
     
-    if (!parameters) {
+    if (false) {
       throw new AppError("Nenhum parâmetro base encontrado. O Gerente precisa configurar os valores antes do cálculo.", 400);
     }
killedBy: calculator routes POST /calculator/calculate returns 400 if parameters are not configured by the manager yet
statusReason: expected 500 to be 400 // Object.is equality

[Killed] BlockStatement
src/modules/calculator/calculator.service.ts:32:22
   static async calculate(input: CalculateCostInput) {
     const parameters = await prisma.calculatorParameter.findFirst();
     
-    if (!parameters) {
-      throw new AppError("Nenhum parâmetro base encontrado. O Gerente precisa configurar os valores antes do cálculo.", 400);
-    }
+    if (!parameters) {}
 
     const filamentCost = (input.filament_weight_grams / 1000) * parameters.filament_price;
killedBy: calculator routes POST /calculator/calculate returns 400 if parameters are not configured by the manager yet
statusReason: expected 500 to be 400 // Object.is equality

[Killed] ArithmeticOperator
src/modules/calculator/calculator.service.ts:36:27
       throw new AppError("Nenhum parâmetro base encontrado. O Gerente precisa configurar os valores antes do cálculo.", 400);
     }
 
-    const filamentCost = (input.filament_weight_grams / 1000) * parameters.filament_price;
+    const filamentCost = (input.filament_weight_grams * 1000) * parameters.filament_price;
 
     const energyCost = input.kwh_used * parameters.kw_cost;
killedBy: calculator routes POST /calculator/calculate returns 200 and calculates total cost and suggested price correctly
statusReason: expected { inputs: { …(2) }, …(3) } to deeply equal { inputs: { …(2) }, …(3) }

[Killed] ArithmeticOperator
src/modules/calculator/calculator.service.ts:36:26
       throw new AppError("Nenhum parâmetro base encontrado. O Gerente precisa configurar os valores antes do cálculo.", 400);
     }
 
-    const filamentCost = (input.filament_weight_grams / 1000) * parameters.filament_price;
+    const filamentCost = input.filament_weight_grams / 1000 / parameters.filament_price;
 
     const energyCost = input.kwh_used * parameters.kw_cost;
killedBy: calculator routes POST /calculator/calculate returns 200 and calculates total cost and suggested price correctly
statusReason: expected { inputs: { …(2) }, …(3) } to deeply equal { inputs: { …(2) }, …(3) }

[Killed] ArithmeticOperator
src/modules/calculator/calculator.service.ts:38:24
 
     const filamentCost = (input.filament_weight_grams / 1000) * parameters.filament_price;
 
-    const energyCost = input.kwh_used * parameters.kw_cost;
+    const energyCost = input.kwh_used / parameters.kw_cost;
 
     const depreciationCost = parameters.depreciation;
killedBy: calculator routes POST /calculator/calculate returns 200 and calculates total cost and suggested price correctly
statusReason: expected { inputs: { …(2) }, …(3) } to deeply equal { inputs: { …(2) }, …(3) }

[Killed] ArithmeticOperator
src/modules/calculator/calculator.service.ts:42:23
 
     const depreciationCost = parameters.depreciation;
 
-    const totalCost = filamentCost + energyCost + depreciationCost;
+    const totalCost = filamentCost + energyCost - depreciationCost;
 
     const suggestedPrice = totalCost * (1 + parameters.profit_margin / 100);
killedBy: calculator routes POST /calculator/calculate returns 200 and calculates total cost and suggested price correctly
statusReason: expected { inputs: { …(2) }, …(3) } to deeply equal { inputs: { …(2) }, …(3) }

[Killed] ArithmeticOperator
src/modules/calculator/calculator.service.ts:42:23
 
     const depreciationCost = parameters.depreciation;
 
-    const totalCost = filamentCost + energyCost + depreciationCost;
+    const totalCost = filamentCost - energyCost + depreciationCost;
 
     const suggestedPrice = totalCost * (1 + parameters.profit_margin / 100);
killedBy: calculator routes POST /calculator/calculate returns 200 and calculates total cost and suggested price correctly
statusReason: expected { inputs: { …(2) }, …(3) } to deeply equal { inputs: { …(2) }, …(3) }

[Killed] ArithmeticOperator
src/modules/calculator/calculator.service.ts:44:45
 
     const totalCost = filamentCost + energyCost + depreciationCost;
 
-    const suggestedPrice = totalCost * (1 + parameters.profit_margin / 100);
+    const suggestedPrice = totalCost * (1 + parameters.profit_margin * 100);
 
     return {
killedBy: calculator routes POST /calculator/calculate returns 200 and calculates total cost and suggested price correctly
statusReason: expected { inputs: { …(2) }, …(3) } to deeply equal { inputs: { …(2) }, …(3) }

[Killed] ArithmeticOperator
src/modules/calculator/calculator.service.ts:44:41
 
     const totalCost = filamentCost + energyCost + depreciationCost;
 
-    const suggestedPrice = totalCost * (1 + parameters.profit_margin / 100);
+    const suggestedPrice = totalCost * (1 - parameters.profit_margin / 100);
 
     return {
killedBy: calculator routes POST /calculator/calculate returns 200 and calculates total cost and suggested price correctly
statusReason: expected { inputs: { …(2) }, …(3) } to deeply equal { inputs: { …(2) }, …(3) }
