[Killed] BlockStatement
src/modules/client/clients.controller.ts:7:69
 
 export class ClientsController {
     
-    static async list(request: FastifyRequest, reply: FastifyReply) {
-        const { page, pageSize, search } = listClientsQuerySchema.parse(request.query);
-        const clients = await ClientsService.list(page, pageSize, search);
-        return reply.send(clients);
-    }
+    static async list(request: FastifyRequest, reply: FastifyReply) {}
     static async listWithOrders(
         request: FastifyRequest,
killedBy: clients routes GET /clients returns 200 and a list of clients
statusReason: Unexpected end of JSON input

[Killed] BlockStatement
src/modules/client/clients.controller.ts:15:11
     static async listWithOrders(
         request: FastifyRequest,
         reply: FastifyReply
-        ) {
-        const { page, pageSize, search } = listClientsQuerySchema.parse(request.query);
-        const clients = await ClientsService.listWithOrders(page, pageSize, search);
-
-        return reply.send(clients);
-    }
+        ) {}
 
     static async getOne(
killedBy: clients routes GET /clients/with-orders returns 200 and clients with their orders count
statusReason: Unexpected end of JSON input

[Killed] BlockStatement
src/modules/client/clients.controller.ts:24:30
 
     static async getOne(
         request: FastifyRequest,
-        reply: FastifyReply) {
-
-        const { id } = request.params as { id: string };
-        const client = await ClientsService.getById(Number(id));
-
-        return reply.send(client);
-    }
+        reply: FastifyReply) {}
     
     static async getOneWithOrders(
killedBy: clients routes GET /clients/:id returns 200 and the client when found
statusReason: Unexpected end of JSON input

[Killed] BlockStatement
src/modules/client/clients.controller.ts:35:11
     static async getOneWithOrders(
         request: FastifyRequest,
         reply: FastifyReply
-        ) {
-
-        const { id } = request.params as {
-            id: string;
-        };
-
-        const client = await ClientsService.getByIdWithOrders(Number(id));
-
-        return reply.send(client);
-    }
+        ) {}
     static async create(request: FastifyRequest, reply: FastifyReply) {
         const data = createClientSchema.parse(request.body);
killedBy: clients routes GET /clients/:id/with-orders returns 200 and the client with orders when found
statusReason: Unexpected end of JSON input

[Killed] BlockStatement
src/modules/client/clients.controller.ts:45:71
 
         return reply.send(client);
     }
-    static async create(request: FastifyRequest, reply: FastifyReply) {
-        const data = createClientSchema.parse(request.body);
-        const client = await ClientsService.create(data);
-        return reply.status(201).send(client);
-    }
+    static async create(request: FastifyRequest, reply: FastifyReply) {}
     static async update(request: FastifyRequest, reply: FastifyReply) {
         const { id } = request.params as { id: string };
killedBy: clients routes POST /clients returns 201 and the created client
statusReason: expected 200 to be 201 // Object.is equality

[Killed] BlockStatement
src/modules/client/clients.controller.ts:50:71
         const client = await ClientsService.create(data);
         return reply.status(201).send(client);
     }
-    static async update(request: FastifyRequest, reply: FastifyReply) {
-        const { id } = request.params as { id: string };
-        const data = updateClientSchema.parse(request.body);
-        const client = await ClientsService.update(Number(id), data);
-        return reply.send(client);
-    }
+    static async update(request: FastifyRequest, reply: FastifyReply) {}
     static async delete(request: FastifyRequest, reply: FastifyReply) {
         const { id } = request.params as { id: string };
killedBy: clients routes PATCH /clients/:id returns 200 and the updated client
statusReason: Unexpected end of JSON input

[Killed] BlockStatement
src/modules/client/clients.controller.ts:56:71
         const client = await ClientsService.update(Number(id), data);
         return reply.send(client);
     }
-    static async delete(request: FastifyRequest, reply: FastifyReply) {
-        const { id } = request.params as { id: string };
-        const result = await ClientsService.delete(Number(id));
-        return reply.send(result);
-    }
+    static async delete(request: FastifyRequest, reply: FastifyReply) {}
 }
killedBy: clients routes DELETE /clients/:id returns 200 and a success message when client has no orders
statusReason: Unexpected end of JSON input
