[Killed] StringLiteral
src/modules/client/clients.routes.ts:17:5
   );
 
   app.get(
-    "/with-orders",
+    "",
     { preHandler: [checkRole(["OPERACIONAL","GERENTE"])] },
     ClientsController.listWithOrders
killedBy: clients routes GET /clients returns 200 and a list of clients
statusReason: Method 'GET' already declared for route '/clients'

[Survived] ObjectLiteral
src/modules/client/clients.routes.ts:18:5
 
   app.get(
     "/with-orders",
-    { preHandler: [checkRole(["OPERACIONAL","GERENTE"])] },
+    {},
     ClientsController.listWithOrders
   );

[Killed] ArrayDeclaration
src/modules/client/clients.routes.ts:36:30
 
   app.post(
     "/",
-    { preHandler: [checkRole(["OPERACIONAL","GERENTE"])] },
+    { preHandler: [checkRole([])] },
     ClientsController.create
   );
killedBy: clients routes POST /clients returns 201 and the created client
statusReason: expected 403 to be 201 // Object.is equality

[Survived] ArrayDeclaration
src/modules/client/clients.routes.ts:36:19
 
   app.post(
     "/",
-    { preHandler: [checkRole(["OPERACIONAL","GERENTE"])] },
+    { preHandler: [] },
     ClientsController.create
   );

[Killed] StringLiteral
src/modules/client/clients.routes.ts:42:45
 
   app.patch(
     "/:id",
-    { preHandler: [checkRole(["OPERACIONAL","GERENTE"])] },
+    { preHandler: [checkRole(["OPERACIONAL",""])] },
     ClientsController.update
   );
killedBy: clients routes PATCH /clients/:id returns 200 and the updated client
statusReason: expected 403 to be 200 // Object.is equality

[Survived] ObjectLiteral
src/modules/client/clients.routes.ts:42:5
 
   app.patch(
     "/:id",
-    { preHandler: [checkRole(["OPERACIONAL","GERENTE"])] },
+    {},
     ClientsController.update
   );

[Killed] StringLiteral
src/modules/client/clients.routes.ts:47:5
   );
 
   app.delete(
-    "/:id",
+    "",
     { preHandler: [checkRole(["OPERACIONAL","GERENTE"])] },
     ClientsController.delete
killedBy: clients routes DELETE /clients/:id returns 200 and a success message when client has no orders
statusReason: expected 404 to be 200 // Object.is equality
