[Killed] BlockStatement
src/modules/client/clients.service.ts:8:81
 
 export class ClientsService {
 
-    static async list(page: number = 1, pageSize: number = 10, search?: string) {
-        return paginatePrisma(
-            prisma.client,
-            {
-                where: search
-                    ? {
-                        name: {
-                        contains: search,
-                        mode: "insensitive" as const,
-                        },
-                    }
-                    : undefined,
-                orderBy: {
-                    name: "asc" as const,
-                },
-            },
-            { page, pageSize }
-        );
-    }
+    static async list(page: number = 1, pageSize: number = 10, search?: string) {}
 
     static async listWithOrders(page: number = 1, pageSize: number = 10, search?: string) {
killedBy: clients routes GET /clients returns 200 and a list of clients
statusReason: Unexpected end of JSON input

[Killed] ObjectLiteral
src/modules/client/clients.service.ts:13:23
             prisma.client,
             {
                 where: search
-                    ? {
-                        name: {
-                        contains: search,
-                        mode: "insensitive" as const,
-                        },
-                    }
+                    ? {}
                     : undefined,
                 orderBy: {
killedBy: clients routes GET /clients returns 200 and filters clients by search query
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ObjectLiteral
src/modules/client/clients.service.ts:24:13
                     name: "asc" as const,
                 },
             },
-            { page, pageSize }
+            {}
         );
     }
killedBy: clients routes GET /clients returns 200 and a list of clients
statusReason: expected { data: [ { id: 1, …(3) } ], …(1) } to match object { data: [ { id: 1, …(1) } ], …(1) }

[Killed] ObjectLiteral
src/modules/client/clients.service.ts:34:31
             {
                 where: search
                     ? {
-                        name: {
-                        contains: search,
-                        mode: "insensitive" as const,
-                        },
+                        name: {},
                     }
                     : undefined,
killedBy: clients routes GET /clients/with-orders returns 200 and filters clients with orders by search query
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Survived] BooleanLiteral
src/modules/client/clients.service.ts:43:37
                 include: {
                     _count: {
                         select: {
-                            orders: true,
+                            orders: false,
                         },
                     },

[Survived] ObjectLiteral
src/modules/client/clients.service.ts:47:26
                         },
                     },
                 },
-                orderBy: {
-                    name: "asc" as const,
-                },
+                orderBy: {},
             },
             { page, pageSize }

[Killed] ArrowFunction
src/modules/client/clients.service.ts:56:44
 
         return {
             ...paginatedResult,
-            data: paginatedResult.data.map((client: any) => ({
-                id: client.id,
-                name: client.name,
-                phone: client.phone,
-                email: client.email,
-                ordersCount: client._count?.orders ?? 0,
-            })),
+            data: paginatedResult.data.map(() => undefined),
         };
   }
killedBy: clients routes GET /clients/with-orders returns 200 and clients with their orders count
statusReason: expected { data: [ null ], meta: { …(5) } } to match object { data: [ { id: 1, …(2) } ], …(1) }

[Killed] ObjectLiteral
src/modules/client/clients.service.ts:56:62
 
         return {
             ...paginatedResult,
-            data: paginatedResult.data.map((client: any) => ({
-                id: client.id,
-                name: client.name,
-                phone: client.phone,
-                email: client.email,
-                ordersCount: client._count?.orders ?? 0,
-            })),
+            data: paginatedResult.data.map((client: any) => ({})),
         };
   }
killedBy: clients routes GET /clients/with-orders returns 200 and clients with their orders count
statusReason: expected { data: [ {} ], meta: { …(5) } } to match object { data: [ { id: 1, …(2) } ], …(1) }

[Killed] LogicalOperator
src/modules/client/clients.service.ts:61:30
                 name: client.name,
                 phone: client.phone,
                 email: client.email,
-                ordersCount: client._count?.orders ?? 0,
+                ordersCount: client._count?.orders && 0,
             })),
         };
killedBy: clients routes GET /clients/with-orders returns 200 and clients with their orders count
statusReason: expected { data: [ { id: 1, …(2) } ], …(1) } to match object { data: [ { id: 1, …(2) } ], …(1) }

[Survived] OptionalChaining
src/modules/client/clients.service.ts:61:30
                 name: client.name,
                 phone: client.phone,
                 email: client.email,
-                ordersCount: client._count?.orders ?? 0,
+                ordersCount: client._count.orders ?? 0,
             })),
         };

[Killed] BlockStatement
src/modules/client/clients.service.ts:66:38
         };
   }
   
-    static async getById(id: number) {
-        const client = await prisma.client.findUnique({
-            where: { id },
-            }
-        );
-
-        if (!client) {
-            throw new AppError("Cliente não encontrado", 404);
-        }
-        return client;
-  }
+    static async getById(id: number) {}
 
     static async getByIdWithOrders(id: number) {
killedBy: clients routes GET /clients/:id returns 200 and the client when found
statusReason: Unexpected end of JSON input

[Killed] BlockStatement
src/modules/client/clients.service.ts:72:22
             }
         );
 
-        if (!client) {
-            throw new AppError("Cliente não encontrado", 404);
-        }
+        if (!client) {}
         return client;
   }
killedBy: clients routes GET /clients/:id returns 404 when client does not exist
statusReason: expected 200 to be 404 // Object.is equality

[Killed] ConditionalExpression
src/modules/client/clients.service.ts:72:13
             }
         );
 
-        if (!client) {
+        if (true) {
             throw new AppError("Cliente não encontrado", 404);
         }
killedBy: clients routes GET /clients/:id returns 200 and the client when found
statusReason: expected 404 to be 200 // Object.is equality

[Killed] BlockStatement
src/modules/client/clients.service.ts:78:48
         return client;
   }
 
-    static async getByIdWithOrders(id: number) {
-        const client = await prisma.client.findUnique({
-            where: { id },
-
-            include: {
-                orders: true,
-            },
-        });
-
-        if (!client) {
-            throw new AppError("Cliente não encontrado", 404);
-        }
-        return client;
-    }
+    static async getByIdWithOrders(id: number) {}
 
   static async create(data: CreateClientInput) {
killedBy: clients routes GET /clients/:id/with-orders returns 200 and the client with orders when found
statusReason: Unexpected end of JSON input

[Survived] ObjectLiteral
src/modules/client/clients.service.ts:80:20
 
     static async getByIdWithOrders(id: number) {
         const client = await prisma.client.findUnique({
-            where: { id },
+            where: {},
 
             include: {

[Survived] BooleanLiteral
src/modules/client/clients.service.ts:83:25
             where: { id },
 
             include: {
-                orders: true,
+                orders: false,
             },
         });

[Killed] BlockStatement
src/modules/client/clients.service.ts:93:48
         return client;
     }
 
-  static async create(data: CreateClientInput) {
-        if (data.phone) {
-            const existing = await prisma.client.findFirst({
-                where: { phone: data.phone }
-            });
-            if (existing) {
-                throw new AppError("Já existe um cliente cadastrado com este telefone.", 409);
-            }
-        }
-        return prisma.client.create({ data });
-    }
+  static async create(data: CreateClientInput) {}
 
   static async update(id: number, data: UpdateClientInput) {
killedBy: clients routes POST /clients returns 201 and the created client
statusReason: Unexpected end of JSON input

[Killed] BlockStatement
src/modules/client/clients.service.ts:94:25
     }
 
   static async create(data: CreateClientInput) {
-        if (data.phone) {
-            const existing = await prisma.client.findFirst({
-                where: { phone: data.phone }
-            });
-            if (existing) {
-                throw new AppError("Já existe um cliente cadastrado com este telefone.", 409);
-            }
-        }
+        if (data.phone) {}
         return prisma.client.create({ data });
     }
killedBy: RF-15 — Criação de Clientes (Blackbox) TC-RF15-04 - Impedir cadastro com mesmo telefone (duplicidade)
statusReason: expected 201 to be 409 // Object.is equality

[Killed] ConditionalExpression
src/modules/client/clients.service.ts:94:13
     }
 
   static async create(data: CreateClientInput) {
-        if (data.phone) {
+        if (false) {
             const existing = await prisma.client.findFirst({
                 where: { phone: data.phone }
killedBy: RF-15 — Criação de Clientes (Blackbox) TC-RF15-04 - Impedir cadastro com mesmo telefone (duplicidade)
statusReason: expected 201 to be 409 // Object.is equality

[Killed] BlockStatement
src/modules/client/clients.service.ts:98:27
             const existing = await prisma.client.findFirst({
                 where: { phone: data.phone }
             });
-            if (existing) {
-                throw new AppError("Já existe um cliente cadastrado com este telefone.", 409);
-            }
+            if (existing) {}
         }
         return prisma.client.create({ data });
killedBy: RF-15 — Criação de Clientes (Blackbox) TC-RF15-04 - Impedir cadastro com mesmo telefone (duplicidade)
statusReason: expected 201 to be 409 // Object.is equality

[Survived] StringLiteral
src/modules/client/clients.service.ts:99:36
                 where: { phone: data.phone }
             });
             if (existing) {
-                throw new AppError("Já existe um cliente cadastrado com este telefone.", 409);
+                throw new AppError("", 409);
             }
         }

[Killed] BlockStatement
src/modules/client/clients.service.ts:105:60
         return prisma.client.create({ data });
     }
 
-  static async update(id: number, data: UpdateClientInput) {
-        await ClientsService.getById(id);
-        return prisma.client.update({
-            where: { id },
-            data,
-            });
-        }
+  static async update(id: number, data: UpdateClientInput) {}
 
   static async delete(id: number) {
killedBy: clients routes PATCH /clients/:id returns 200 and the updated client
statusReason: Unexpected end of JSON input

[Killed] BooleanLiteral
src/modules/client/clients.service.ts:125:13
             },
         });
 
-        if (!client) {
+        if (client) {
             throw new AppError("Cliente não encontrado", 404);
         }
killedBy: clients routes DELETE /clients/:id returns 200 and a success message when client has no orders
statusReason: expected 404 to be 200 // Object.is equality

[Killed] StringLiteral
src/modules/client/clients.service.ts:126:32
         });
 
         if (!client) {
-            throw new AppError("Cliente não encontrado", 404);
+            throw new AppError("", 404);
         }
 
killedBy: clients routes DELETE /clients/:id returns 404 when client does not exist
statusReason: expected { error: '' } to deeply equal { error: 'Cliente não encontrado' }

[Killed] EqualityOperator
src/modules/client/clients.service.ts:129:13
             throw new AppError("Cliente não encontrado", 404);
         }
 
-        if (client._count.orders > 0) {
+        if (client._count.orders <= 0) {
             throw new AppError(
             "Não é possível remover um cliente com pedidos vinculados",
killedBy: clients routes DELETE /clients/:id returns 200 and a success message when client has no orders
statusReason: expected 400 to be 200 // Object.is equality

[Killed] EqualityOperator
src/modules/client/clients.service.ts:129:13
             throw new AppError("Cliente não encontrado", 404);
         }
 
-        if (client._count.orders > 0) {
+        if (client._count.orders >= 0) {
             throw new AppError(
             "Não é possível remover um cliente com pedidos vinculados",
killedBy: clients routes DELETE /clients/:id returns 200 and a success message when client has no orders
statusReason: expected 400 to be 200 // Object.is equality

[Killed] StringLiteral
src/modules/client/clients.service.ts:139:22
             where: { id },
         });
         return {
-            message: "Cliente removido com sucesso",
+            message: "",
         };
   }
killedBy: clients routes DELETE /clients/:id returns 200 and a success message when client has no orders
statusReason: expected { message: '' } to deeply equal { Object (message) }
