[Killed] BlockStatement
src/modules/dashboard/dashboard.controller.ts:6:73
 import { DashboardService } from "./dashboard.service";
 
 export class DashboardController {
-  static async financeiro(request: FastifyRequest, reply: FastifyReply) {
-    const { periodo, ref, tagType } = financeiroQuerySchema.parse(request.query);
-    const result = await DashboardService.getFinanceiro(periodo, ref, tagType);
-    return reply.send(result);
-  }
+  static async financeiro(request: FastifyRequest, reply: FastifyReply) {}
 
   static async operacional(request: FastifyRequest, reply: FastifyReply) {
killedBy: dashboard routes GET /financeiro returns 200 with aggregated financial data for GERENTE
statusReason: Unexpected end of JSON input

[Killed] BlockStatement
src/modules/dashboard/dashboard.controller.ts:12:74
     return reply.send(result);
   }
 
-  static async operacional(request: FastifyRequest, reply: FastifyReply) {
-    const { periodo, ref, tagType } = operacionalQuerySchema.parse(request.query);
-    const result = await DashboardService.getOperacional(periodo, ref, tagType);
-    return reply.send(result);
-  }
+  static async operacional(request: FastifyRequest, reply: FastifyReply) {}
 }
 
killedBy: dashboard routes GET /operacional returns 200 with tag counts grouped by tagType
statusReason: Unexpected end of JSON input
