[Killed] BlockStatement
src/modules/dashboard/dashboard.routes.ts:6:61
 import { verifyJWT } from "../../middlewares/auth";
 import { checkRole } from "../../middlewares/rbac";
 
-export async function dashboardRoutes(app: FastifyInstance) {
-  app.get(
-    "/financeiro",
-    { preHandler: [verifyJWT, checkRole(["GERENTE"])] },
-    DashboardController.financeiro,
-  );
-
-  app.get(
-    "/operacional",
-    { preHandler: [verifyJWT, checkRole(["OPERACIONAL", "GERENTE"])] },
-    DashboardController.operacional,
-  );
-}
+export async function dashboardRoutes(app: FastifyInstance) {}
 
killedBy: dashboard routes GET /financeiro returns 200 with aggregated financial data for GERENTE
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ArrayDeclaration
src/modules/dashboard/dashboard.routes.ts:9:19
 export async function dashboardRoutes(app: FastifyInstance) {
   app.get(
     "/financeiro",
-    { preHandler: [verifyJWT, checkRole(["GERENTE"])] },
+    { preHandler: [] },
     DashboardController.financeiro,
   );
killedBy: dashboard routes GET /financeiro returns 401 when token is missing
statusReason: expected 200 to be 401 // Object.is equality

[Killed] ObjectLiteral
src/modules/dashboard/dashboard.routes.ts:9:5
 export async function dashboardRoutes(app: FastifyInstance) {
   app.get(
     "/financeiro",
-    { preHandler: [verifyJWT, checkRole(["GERENTE"])] },
+    {},
     DashboardController.financeiro,
   );
killedBy: dashboard routes GET /financeiro returns 401 when token is missing
statusReason: expected 200 to be 401 // Object.is equality

[Killed] ArrayDeclaration
src/modules/dashboard/dashboard.routes.ts:15:19
 
   app.get(
     "/operacional",
-    { preHandler: [verifyJWT, checkRole(["OPERACIONAL", "GERENTE"])] },
+    { preHandler: [] },
     DashboardController.operacional,
   );
killedBy: dashboard routes GET /operacional returns 401 when token is missing
statusReason: expected 200 to be 401 // Object.is equality
