[Killed] ConditionalExpression
src/modules/dashboard/dashboard.service.ts:20:9
     const where: Record<string, unknown> = {
       created_at: { gte: start, lte: end },
     };
-    if (tagType) where.tagType = tagType;
+    if (false) where.tagType = tagType;
 
     const result = await prisma.order.aggregate({
killedBy: dashboard routes GET /financeiro applies the tagType filter to the Prisma where clause
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
src/modules/dashboard/dashboard.service.ts:20:9
     const where: Record<string, unknown> = {
       created_at: { gte: start, lte: end },
     };
-    if (tagType) where.tagType = tagType;
+    if (true) where.tagType = tagType;
 
     const result = await prisma.order.aggregate({
killedBy: dashboard routes GET /financeiro does not include tagType in where clause when not provided
statusReason: expected { created_at: { …(2) }, …(1) } to not have property "tagType"

[Survived] BooleanLiteral
src/modules/dashboard/dashboard.service.ts:23:40
     if (tagType) where.tagType = tagType;
 
     const result = await prisma.order.aggregate({
-      _sum: { amount_paid: true, cost: true },
+      _sum: { amount_paid: true, cost: false },
       _avg: { amount_paid: true, price: true },
       _count: { id: true },

[Survived] BooleanLiteral
src/modules/dashboard/dashboard.service.ts:23:28
     if (tagType) where.tagType = tagType;
 
     const result = await prisma.order.aggregate({
-      _sum: { amount_paid: true, cost: true },
+      _sum: { amount_paid: false, cost: true },
       _avg: { amount_paid: true, price: true },
       _count: { id: true },

[Survived] BooleanLiteral
src/modules/dashboard/dashboard.service.ts:24:28
 
     const result = await prisma.order.aggregate({
       _sum: { amount_paid: true, cost: true },
-      _avg: { amount_paid: true, price: true },
+      _avg: { amount_paid: false, price: true },
       _count: { id: true },
       where,

[Survived] BooleanLiteral
src/modules/dashboard/dashboard.service.ts:24:41
 
     const result = await prisma.order.aggregate({
       _sum: { amount_paid: true, cost: true },
-      _avg: { amount_paid: true, price: true },
+      _avg: { amount_paid: true, price: false },
       _count: { id: true },
       where,

[Survived] BooleanLiteral
src/modules/dashboard/dashboard.service.ts:25:21
     const result = await prisma.order.aggregate({
       _sum: { amount_paid: true, cost: true },
       _avg: { amount_paid: true, price: true },
-      _count: { id: true },
+      _count: { id: false },
       where,
     });

[Survived] ObjectLiteral
src/modules/dashboard/dashboard.service.ts:25:15
     const result = await prisma.order.aggregate({
       _sum: { amount_paid: true, cost: true },
       _avg: { amount_paid: true, price: true },
-      _count: { id: true },
+      _count: {},
       where,
     });

[Killed] LogicalOperator
src/modules/dashboard/dashboard.service.ts:29:26
       where,
     });
 
-    const receitaTotal = result._sum.amount_paid ?? 0;
+    const receitaTotal = result._sum.amount_paid && 0;
     const custoTotal = result._sum.cost ?? 0;
 
killedBy: dashboard routes GET /financeiro returns 200 with aggregated financial data for GERENTE
statusReason: expected { periodo: 'MENSAL', …(8) } to match object { periodo: 'MENSAL', …(6) }
(2 matching properties omitted from actual)

[Killed] LogicalOperator
src/modules/dashboard/dashboard.service.ts:30:24
     });
 
     const receitaTotal = result._sum.amount_paid ?? 0;
-    const custoTotal = result._sum.cost ?? 0;
+    const custoTotal = result._sum.cost && 0;
 
     return {
killedBy: RF-11 — Visualização do Dashboard Financeiro (Blackbox) TC-RF11-01 - Acessar a aba Dashboard Financeiro e carregar período padrão (mensal) com indicadores financeiros
statusReason: expected { periodo: 'MENSAL', …(8) } to match object { periodo: 'MENSAL', …(6) }
(2 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/modules/dashboard/dashboard.service.ts:38:19
       dataFim: end.toISOString(),
       receitaTotal,
       custoTotal,
-      lucroTotal: receitaTotal - custoTotal,
+      lucroTotal: receitaTotal + custoTotal,
       precoMedio: result._avg.price ?? 0,
       ticketMedio: result._avg.amount_paid ?? 0,
killedBy: RF-11 — Visualização do Dashboard Financeiro (Blackbox) TC-RF11-01 - Acessar a aba Dashboard Financeiro e carregar período padrão (mensal) com indicadores financeiros
statusReason: expected { periodo: 'MENSAL', …(8) } to match object { periodo: 'MENSAL', …(6) }
(2 matching properties omitted from actual)

[Killed] LogicalOperator
src/modules/dashboard/dashboard.service.ts:39:19
       receitaTotal,
       custoTotal,
       lucroTotal: receitaTotal - custoTotal,
-      precoMedio: result._avg.price ?? 0,
+      precoMedio: result._avg.price && 0,
       ticketMedio: result._avg.amount_paid ?? 0,
       totalPedidos: result._count.id,
killedBy: dashboard routes GET /financeiro returns 200 with aggregated financial data for GERENTE
statusReason: expected { periodo: 'MENSAL', …(8) } to match object { periodo: 'MENSAL', …(6) }
(2 matching properties omitted from actual)

[Killed] LogicalOperator
src/modules/dashboard/dashboard.service.ts:40:20
       custoTotal,
       lucroTotal: receitaTotal - custoTotal,
       precoMedio: result._avg.price ?? 0,
-      ticketMedio: result._avg.amount_paid ?? 0,
+      ticketMedio: result._avg.amount_paid && 0,
       totalPedidos: result._count.id,
     };
killedBy: RF-11 — Visualização do Dashboard Financeiro (Blackbox) TC-RF11-01 - Acessar a aba Dashboard Financeiro e carregar período padrão (mensal) com indicadores financeiros
statusReason: expected { periodo: 'MENSAL', …(8) } to match object { periodo: 'MENSAL', …(6) }
(2 matching properties omitted from actual)

[Survived] ObjectLiteral
src/modules/dashboard/dashboard.service.ts:52:44
   ): Promise<DashboardOperacionalResponse> {
     const { start, end } = getDateRange(periodo, ref);
 
-    const where: Record<string, unknown> = {
-      created_at: { gte: start, lte: end },
-    };
+    const where: Record<string, unknown> = {};
     if (tagType) where.tagType = tagType;
 

[Killed] ObjectLiteral
src/modules/dashboard/dashboard.service.ts:57:47
     };
     if (tagType) where.tagType = tagType;
 
-    const result = await prisma.order.groupBy({
-      by: ["tagType"],
-      _count: { id: true },
-      where,
-    });
+    const result = await prisma.order.groupBy({});
 
     const tags = result.map((r) => ({
killedBy: RF-13 — Filtros por Categoria nos Dashboards (Blackbox) TC-RF13-01 - Selecionar apenas a categoria 'Brinde' no filtro
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Survived] ArrayDeclaration
src/modules/dashboard/dashboard.service.ts:58:11
     if (tagType) where.tagType = tagType;
 
     const result = await prisma.order.groupBy({
-      by: ["tagType"],
+      by: [],
       _count: { id: true },
       where,

[Survived] BooleanLiteral
src/modules/dashboard/dashboard.service.ts:59:21
 
     const result = await prisma.order.groupBy({
       by: ["tagType"],
-      _count: { id: true },
+      _count: { id: false },
       where,
     });

[Killed] ArrowFunction
src/modules/dashboard/dashboard.service.ts:63:29
       where,
     });
 
-    const tags = result.map((r) => ({
-      tagType: r.tagType,
-      quantidade: r._count.id,
-    }));
+    const tags = result.map(() => undefined);
 
     const totalPedidos = tags.reduce((sum, t) => sum + t.quantidade, 0);
killedBy: dashboard routes GET /operacional returns 200 with tag counts grouped by tagType
statusReason: expected 500 to be 200 // Object.is equality

[Killed] ArrowFunction
src/modules/dashboard/dashboard.service.ts:68:38
       quantidade: r._count.id,
     }));
 
-    const totalPedidos = tags.reduce((sum, t) => sum + t.quantidade, 0);
+    const totalPedidos = tags.reduce(() => undefined, 0);
 
     return {
killedBy: dashboard routes GET /operacional returns 200 with tag counts grouped by tagType
statusReason: expected { periodo: 'MENSAL', …(3) } to match object { periodo: 'MENSAL', …(2) }
(2 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/modules/dashboard/dashboard.service.ts:68:50
       quantidade: r._count.id,
     }));
 
-    const totalPedidos = tags.reduce((sum, t) => sum + t.quantidade, 0);
+    const totalPedidos = tags.reduce((sum, t) => sum - t.quantidade, 0);
 
     return {
killedBy: RF-10 — Visualização do Dashboard Operacional (Blackbox) TC-RF10-01 - Acessar a aba Dashboard Operacional e carregar período padrão (mensal)
statusReason: expected { periodo: 'MENSAL', …(4) } to match object { periodo: 'MENSAL', totalPedidos: 10 }
(3 matching properties omitted from actual)

[Killed] ObjectLiteral
src/modules/dashboard/dashboard.service.ts:70:12
 
     const totalPedidos = tags.reduce((sum, t) => sum + t.quantidade, 0);
 
-    return {
-      periodo,
-      dataInicio: start.toISOString(),
-      dataFim: end.toISOString(),
-      tags,
-      totalPedidos,
-    };
+    return {};
   }
 }
killedBy: dashboard routes GET /operacional returns 200 with tag counts grouped by tagType
statusReason: expected {} to match object { periodo: 'MENSAL', …(2) }
