[Killed] BlockStatement
src/modules/files/files.routes.ts:7:57
 
 const filesController = new FilesController();
 
-export async function filesRoutes(app: FastifyInstance) {
-    app.addHook("preHandler", verifyJWT);
-
-    app.post("/",
-        filesController.handleUpload
-    );
-
-    app.get("/:fileName",
-        filesController.handleGet
-    );
-
-    app.delete("/:fileName",
-        filesController.handleDelete
-    );
-}
+export async function filesRoutes(app: FastifyInstance) {}
 
killedBy: files routes POST /files returns 201 and the file metadata when upload succeeds
statusReason: expected 404 to be 201 // Object.is equality

[Killed] StringLiteral
src/modules/files/files.routes.ts:18:16
         filesController.handleGet
     );
 
-    app.delete("/:fileName",
+    app.delete("",
         filesController.handleDelete
     );
killedBy: files routes DELETE /files/:fileName returns 200 when file is successfully deleted
statusReason: expected 404 to be 200 // Object.is equality
