[Killed] BlockStatement
src/modules/kanban/kanban.controller.ts:9:5
   static async listSectionTasksHandler(
     request: FastifyRequest,
     reply: FastifyReply,
-  ) {
-    const { taskStatus } = kanbanSectionParamsSchema.parse(request.params);
-    const result = await KanbanService.listTasksBySection(taskStatus);
-
-    return reply.status(200).send(result);
-  }
+  ) {}
 }
 
killedBy: RF-07 — Visualização de Pedidos no Kanban (Blackbox) TC-RF07-01 - Carregar e organizar todos os pedidos cadastrados nas três seções do Kanban
statusReason: Unexpected end of JSON input
