[Killed] BlockStatement
src/modules/kanban/kanban.routes.ts:5:58
 import { verifyJWT } from "../../middlewares/auth";
 import { KanbanController } from "./kanban.controller";
 
-export async function kanbanRoutes(app: FastifyInstance) {
-  app.get(
-    "/sections/:taskStatus",
-    {
-      preHandler: [verifyJWT],
-    },
-    KanbanController.listSectionTasksHandler,
-  );
-}
+export async function kanbanRoutes(app: FastifyInstance) {}
 
killedBy: RF-07 — Visualização de Pedidos no Kanban (Blackbox) TC-RF07-01 - Carregar e organizar todos os pedidos cadastrados nas três seções do Kanban
statusReason: expected 404 to be 200 // Object.is equality

[Killed] StringLiteral
src/modules/kanban/kanban.routes.ts:7:5
 
 export async function kanbanRoutes(app: FastifyInstance) {
   app.get(
-    "/sections/:taskStatus",
+    "",
     {
       preHandler: [verifyJWT],
killedBy: RF-07 — Visualização de Pedidos no Kanban (Blackbox) TC-RF07-01 - Carregar e organizar todos os pedidos cadastrados nas três seções do Kanban
statusReason: expected 404 to be 200 // Object.is equality
