[Killed] BlockStatement
src/modules/kanban/kanban.service.ts:15:59
 };
 
 export class KanbanService {
-  static async listTasksBySection(taskStatus: TaskStatus) {
-    const orderRepository = (prisma as unknown as OrderRepository).order;
-    const tasks = await orderRepository.findMany({
-      where: {
-        section: taskStatus,
-      },
-      include: {
-        tag: true,
-        client: true,
-      },
-      orderBy: {
-        updated_at: "desc",
-      },
-    });
-
-    return {
-      taskStatus,
-      tasks,
-    };
-  }
+  static async listTasksBySection(taskStatus: TaskStatus) {}
 }
 
killedBy: kanban routes GET /kanban/sections/:taskStatus returns 200 and the tasks for a valid section
statusReason: Unexpected end of JSON input

[Killed] ObjectLiteral
src/modules/kanban/kanban.service.ts:17:50
 export class KanbanService {
   static async listTasksBySection(taskStatus: TaskStatus) {
     const orderRepository = (prisma as unknown as OrderRepository).order;
-    const tasks = await orderRepository.findMany({
-      where: {
-        section: taskStatus,
-      },
-      include: {
-        tag: true,
-        client: true,
-      },
-      orderBy: {
-        updated_at: "desc",
-      },
-    });
+    const tasks = await orderRepository.findMany({});
 
     return {
killedBy: kanban routes GET /kanban/sections/:taskStatus returns 200 and the tasks for a valid section
statusReason: expected "vi.fn()" to be called with arguments: [ { …(3) } ]

Received:

  1st vi.fn() call:

  [
-   {

[Killed] ObjectLiteral
src/modules/kanban/kanban.service.ts:21:16
       where: {
         section: taskStatus,
       },
-      include: {
-        tag: true,
-        client: true,
-      },
+      include: {},
       orderBy: {
         updated_at: "desc",
killedBy: kanban routes GET /kanban/sections/:taskStatus returns 200 and the tasks for a valid section
statusReason: expected "vi.fn()" to be called with arguments: [ { …(3) } ]

Received:

  1st vi.fn() call:

@@ -1,11 +1,8 @@
  [

[Killed] BooleanLiteral
src/modules/kanban/kanban.service.ts:22:14
         section: taskStatus,
       },
       include: {
-        tag: true,
+        tag: false,
         client: true,
       },
killedBy: kanban routes GET /kanban/sections/:taskStatus returns 200 and the tasks for a valid section
statusReason: expected "vi.fn()" to be called with arguments: [ { …(3) } ]

Received:

  1st vi.fn() call:

@@ -1,10 +1,10 @@
  [

[Killed] BooleanLiteral
src/modules/kanban/kanban.service.ts:23:17
       },
       include: {
         tag: true,
-        client: true,
+        client: false,
       },
       orderBy: {
killedBy: kanban routes GET /kanban/sections/:taskStatus returns 200 and the tasks for a valid section
statusReason: expected "vi.fn()" to be called with arguments: [ { …(3) } ]

Received:

  1st vi.fn() call:

@@ -1,9 +1,9 @@
  [
