[Killed] BlockStatement
src/modules/order/order.controller.ts:9:64
 
 export class OrderController {
 
-    async create(request: FastifyRequest, reply: FastifyReply) {
-        try {
-            const data = createOrderSchema.parse(request.body);
-            
-            const newOrder = await orderService.createOrder(data);
-            return reply.status(201).send(newOrder);
-        } catch (error: any) {
-            return reply.status(400).send({ error: error.message });
-        }
-    }
+    async create(request: FastifyRequest, reply: FastifyReply) {}
     
     async move(request: FastifyRequest, reply: FastifyReply) {
killedBy: RF-17 — Upload de Arquivos 3D em Pedidos (Blackbox) TC-RF17-05 - Criar pedido sem arquivo anexado (upload não obrigatório)
statusReason: expected 200 to be 201 // Object.is equality

[Killed] BlockStatement
src/modules/order/order.controller.ts:10:13
 export class OrderController {
 
     async create(request: FastifyRequest, reply: FastifyReply) {
-        try {
-            const data = createOrderSchema.parse(request.body);
-            
-            const newOrder = await orderService.createOrder(data);
-            return reply.status(201).send(newOrder);
-        } catch (error: any) {
+        try {} catch (error: any) {
             return reply.status(400).send({ error: error.message });
         }
killedBy: RF-03 — Criação de Pedido no Kanban (Blackbox) TC-RF03-01 - Criar pedido preenchendo todos os campos com dados válidos
statusReason: expected 200 to be 201 // Object.is equality

[Killed] BlockStatement
src/modules/order/order.controller.ts:15:30
             
             const newOrder = await orderService.createOrder(data);
             return reply.status(201).send(newOrder);
-        } catch (error: any) {
-            return reply.status(400).send({ error: error.message });
-        }
+        } catch (error: any) {}
     }
     
killedBy: RF-03 — Criação de Pedido no Kanban (Blackbox) TC-RF03-03 - Impedir criação de pedido com Título em branco
statusReason: expected 200 to be 400 // Object.is equality

[Killed] BlockStatement
src/modules/order/order.controller.ts:20:62
         }
     }
     
-    async move(request: FastifyRequest, reply: FastifyReply) {
-        try {
-            const { id } = request.params as { id: string };
-            const orderId = Number(id);
-
-            if (isNaN(orderId)) {
-                return reply.status(400).send({ error: "ID do pedido inválido." });
-            }
-
-            const { destinationSection } = moveOrderSchema.parse(request.body);
-
-            const movedOrder = await orderService.moveOrder(orderId, destinationSection);
-            return reply.status(200).send(movedOrder);
-        } catch (error: any) {
-            return reply.status(400).send({ error: error.message });
-        }
-    }
+    async move(request: FastifyRequest, reply: FastifyReply) {}
 
     async update(request: FastifyRequest, reply: FastifyReply) {
killedBy: order routes (Kanban) PATCH /orders/:id/move returns 200 and moves the order on Kanban successfully
statusReason: Unexpected end of JSON input

[Killed] BlockStatement
src/modules/order/order.controller.ts:21:13
     }
     
     async move(request: FastifyRequest, reply: FastifyReply) {
-        try {
-            const { id } = request.params as { id: string };
-            const orderId = Number(id);
-
-            if (isNaN(orderId)) {
-                return reply.status(400).send({ error: "ID do pedido inválido." });
-            }
-
-            const { destinationSection } = moveOrderSchema.parse(request.body);
-
-            const movedOrder = await orderService.moveOrder(orderId, destinationSection);
-            return reply.status(200).send(movedOrder);
-        } catch (error: any) {
+        try {} catch (error: any) {
             return reply.status(400).send({ error: error.message });
         }
killedBy: order routes (Kanban) PATCH /orders/:id/move returns 200 and moves the order on Kanban successfully
statusReason: Unexpected end of JSON input

[Killed] BlockStatement
src/modules/order/order.controller.ts:25:33
             const { id } = request.params as { id: string };
             const orderId = Number(id);
 
-            if (isNaN(orderId)) {
-                return reply.status(400).send({ error: "ID do pedido inválido." });
-            }
+            if (isNaN(orderId)) {}
 
             const { destinationSection } = moveOrderSchema.parse(request.body);
killedBy: order routes (Kanban) PATCH /orders/:id/move with invalid ID returns 400 when order ID is not numeric
statusReason: expected { error: 'Pedido não encontrado.' } to deeply equal { error: 'ID do pedido inválido.' }

[Killed] ConditionalExpression
src/modules/order/order.controller.ts:25:17
             const { id } = request.params as { id: string };
             const orderId = Number(id);
 
-            if (isNaN(orderId)) {
+            if (false) {
                 return reply.status(400).send({ error: "ID do pedido inválido." });
             }
killedBy: order routes (Kanban) PATCH /orders/:id/move with invalid ID returns 400 when order ID is not numeric
statusReason: expected 200 to be 400 // Object.is equality

[Killed] StringLiteral
src/modules/order/order.controller.ts:26:56
             const orderId = Number(id);
 
             if (isNaN(orderId)) {
-                return reply.status(400).send({ error: "ID do pedido inválido." });
+                return reply.status(400).send({ error: "" });
             }
 
killedBy: order routes (Kanban) PATCH /orders/:id/move with invalid ID returns 400 when order ID is not numeric
statusReason: expected { error: '' } to deeply equal { error: 'ID do pedido inválido.' }

[Killed] BlockStatement
src/modules/order/order.controller.ts:33:30
 
             const movedOrder = await orderService.moveOrder(orderId, destinationSection);
             return reply.status(200).send(movedOrder);
-        } catch (error: any) {
-            return reply.status(400).send({ error: error.message });
-        }
+        } catch (error: any) {}
     }
 
killedBy: order routes (Kanban) PATCH /orders/:id/move returns 400 when business rules block the movement
statusReason: expected 200 to be 400 // Object.is equality

[Killed] BlockStatement
src/modules/order/order.controller.ts:38:64
         }
     }
 
-    async update(request: FastifyRequest, reply: FastifyReply) {
-        try {
-            const { id } = request.params as { id: string };
-            const orderId = Number(id);
-
-            if (isNaN(orderId)) {
-                return reply.status(400).send({ error: "ID do pedido inválido." });
-            }
-
-            // MUDANÇA AQUI: Valida apenas os campos enviados no PUT usando o esquema parcial
-            const data = updateOrderSchema.parse(request.body);
-
-            const updatedOrder = await orderService.updateOrder(orderId, data);
-            return reply.status(200).send(updatedOrder);
-        } catch (error: any) {
-            return reply.status(400).send({ error: error.message });
-        }
-    }
+    async update(request: FastifyRequest, reply: FastifyReply) {}
 
     async delete(request: FastifyRequest, reply: FastifyReply) {
killedBy: order routes (Kanban) PUT /orders/:id returns 200 and updates order data successfully
statusReason: Unexpected end of JSON input

[Killed] BlockStatement
src/modules/order/order.controller.ts:39:13
     }
 
     async update(request: FastifyRequest, reply: FastifyReply) {
-        try {
-            const { id } = request.params as { id: string };
-            const orderId = Number(id);
-
-            if (isNaN(orderId)) {
-                return reply.status(400).send({ error: "ID do pedido inválido." });
-            }
-
-            // MUDANÇA AQUI: Valida apenas os campos enviados no PUT usando o esquema parcial
-            const data = updateOrderSchema.parse(request.body);
-
-            const updatedOrder = await orderService.updateOrder(orderId, data);
-            return reply.status(200).send(updatedOrder);
-        } catch (error: any) {
+        try {} catch (error: any) {
             return reply.status(400).send({ error: error.message });
         }
killedBy: RF-17 — Upload de Arquivos 3D em Pedidos (Blackbox) TC-RF17-06 - Anexar arquivo 'revisao_v2.stl' (2 MB) na edição de pedido que não tinha anexo
statusReason: Unexpected end of JSON input

[Killed] BlockStatement
src/modules/order/order.controller.ts:52:30
 
             const updatedOrder = await orderService.updateOrder(orderId, data);
             return reply.status(200).send(updatedOrder);
-        } catch (error: any) {
-            return reply.status(400).send({ error: error.message });
-        }
+        } catch (error: any) {}
     }
 
killedBy: order routes (Kanban) PUT /orders/:id with invalid ID returns 400 when order is not found
statusReason: expected 200 to be 400 // Object.is equality

[Killed] ObjectLiteral
src/modules/order/order.controller.ts:53:43
             const updatedOrder = await orderService.updateOrder(orderId, data);
             return reply.status(200).send(updatedOrder);
         } catch (error: any) {
-            return reply.status(400).send({ error: error.message });
+            return reply.status(400).send({});
         }
     }
killedBy: order routes (Kanban) PUT /orders/:id with invalid ID returns 400 when order is not found
statusReason: expected {} to have property "error"

[Killed] BlockStatement
src/modules/order/order.controller.ts:57:64
         }
     }
 
-    async delete(request: FastifyRequest, reply: FastifyReply) {
-        try {
-            const { id } = request.params as { id: string };
-            const orderId = Number(id);
-
-            if (isNaN(orderId)) {
-                return reply.status(400).send({ error: "ID do pedido inválido." });
-            }
-
-            const result = await orderService.deleteOrder(orderId);
-            return reply.status(200).send(result);
-        } catch (error: any) {
-            return reply.status(400).send({ error: error.message });
-        }
-    }
+    async delete(request: FastifyRequest, reply: FastifyReply) {}
 
     async get(request: FastifyRequest, reply: FastifyReply) {
killedBy: order routes (Kanban) DELETE /orders/:id with invalid ID returns 400 when order ID is not numeric
statusReason: expected 200 to be 400 // Object.is equality

[Killed] BlockStatement
src/modules/order/order.controller.ts:58:13
     }
 
     async delete(request: FastifyRequest, reply: FastifyReply) {
-        try {
-            const { id } = request.params as { id: string };
-            const orderId = Number(id);
-
-            if (isNaN(orderId)) {
-                return reply.status(400).send({ error: "ID do pedido inválido." });
-            }
-
-            const result = await orderService.deleteOrder(orderId);
-            return reply.status(200).send(result);
-        } catch (error: any) {
+        try {} catch (error: any) {
             return reply.status(400).send({ error: error.message });
         }
killedBy: order routes (Kanban) DELETE /orders/:id with invalid ID returns 400 when order ID is not numeric
statusReason: expected 200 to be 400 // Object.is equality

[Killed] ConditionalExpression
src/modules/order/order.controller.ts:62:17
             const { id } = request.params as { id: string };
             const orderId = Number(id);
 
-            if (isNaN(orderId)) {
+            if (true) {
                 return reply.status(400).send({ error: "ID do pedido inválido." });
             }
killedBy: order routes (Kanban) DELETE /orders/:id TC-RF04-01 - returns 200 when order is successfully deleted
statusReason: expected 400 to be 200 // Object.is equality

[Killed] BlockStatement
src/modules/order/order.controller.ts:68:30
 
             const result = await orderService.deleteOrder(orderId);
             return reply.status(200).send(result);
-        } catch (error: any) {
-            return reply.status(400).send({ error: error.message });
-        }
+        } catch (error: any) {}
     }
 
killedBy: order routes (Kanban) DELETE /orders/:id with invalid ID returns 400 when order is not found
statusReason: expected 200 to be 400 // Object.is equality

[Killed] BlockStatement
src/modules/order/order.controller.ts:73:61
         }
     }
 
-    async get(request: FastifyRequest, reply: FastifyReply) {
-        try {
-            const { page, pageSize, ...filters } = getOrderQuerySchema.parse(request.query);            
-            const orders = await orderService.getOrders(page, pageSize, filters);
-            return reply.status(200).send(orders);
-        } catch (error: any) {
-            return reply.status(400).send({ error: error.message });
-        }
-    }
+    async get(request: FastifyRequest, reply: FastifyReply) {}
 }
killedBy: order routes (Kanban) GET /orders (Paginação e Filtros Dinâmicos) returns 200, paginated orders and correct metadata structure
statusReason: Unexpected end of JSON input

[Killed] BlockStatement
src/modules/order/order.controller.ts:74:13
     }
 
     async get(request: FastifyRequest, reply: FastifyReply) {
-        try {
-            const { page, pageSize, ...filters } = getOrderQuerySchema.parse(request.query);            
-            const orders = await orderService.getOrders(page, pageSize, filters);
-            return reply.status(200).send(orders);
-        } catch (error: any) {
+        try {} catch (error: any) {
             return reply.status(400).send({ error: error.message });
         }
killedBy: order routes (Kanban) GET /orders (Paginação e Filtros Dinâmicos) returns 200, paginated orders and correct metadata structure
statusReason: Unexpected end of JSON input

[Killed] BlockStatement
src/modules/order/order.controller.ts:78:30
             const { page, pageSize, ...filters } = getOrderQuerySchema.parse(request.query);            
             const orders = await orderService.getOrders(page, pageSize, filters);
             return reply.status(200).send(orders);
-        } catch (error: any) {
-            return reply.status(400).send({ error: error.message });
-        }
+        } catch (error: any) {}
     }
 }
killedBy: order routes (Kanban) GET /orders with different filter types returns 400 when getOrders throws a generic error
statusReason: expected 200 to be 400 // Object.is equality
