[Killed] StringLiteral
src/modules/order/order.routes.ts:15:9
     );
     
     app.put(
-        "/orders/:id",
+        "",
         { preHandler: [verifyJWT] },
         orderController.update
killedBy: auth routes POST /auth/register returns 201 and creates a user
statusReason: The path could not be empty

[Killed] StringLiteral
src/modules/order/order.routes.ts:21:9
     );
 
     app.patch(
-        "/orders/:id/move",
+        "",
         { preHandler: [verifyJWT] },
         orderController.move
killedBy: auth routes POST /auth/register returns 201 and creates a user
statusReason: The path could not be empty

[Survived] ObjectLiteral
src/modules/order/order.routes.ts:22:9
 
     app.patch(
         "/orders/:id/move",
-        { preHandler: [verifyJWT] },
+        {},
         orderController.move
     );

[Survived] ArrayDeclaration
src/modules/order/order.routes.ts:28:23
 
     app.delete(
         "/orders/:id",
-        { preHandler: [verifyJWT] },
+        { preHandler: [] },
         orderController.delete
     );

[Survived] ObjectLiteral
src/modules/order/order.routes.ts:34:9
 
     app.get(
         "/orders",
-        { preHandler: [verifyJWT] },
+        {},
         orderController.get
     );
