[Killed] BlockStatement
src/modules/tags/tags.controller.ts:10:69
 import { TagsService } from "./tags.service";
 
 export class TagsController {
-  static async create(request: FastifyRequest, reply: FastifyReply) {
-    const data = createTagSchema.parse(request.body);
-    const tag = await TagsService.create(data);
-    return reply.status(201).send(tag);
-  }
+  static async create(request: FastifyRequest, reply: FastifyReply) {}
 
   static async findAll(_request: FastifyRequest, reply: FastifyReply) {
killedBy: tags routes POST /tags returns 201 and the created tag
statusReason: expected 200 to be 201 // Object.is equality

[Killed] BlockStatement
src/modules/tags/tags.controller.ts:16:71
     return reply.status(201).send(tag);
   }
 
-  static async findAll(_request: FastifyRequest, reply: FastifyReply) {
-    const tags = await TagsService.findAll();
-    return reply.send(tags);
-  }
+  static async findAll(_request: FastifyRequest, reply: FastifyReply) {}
 
   static async findById(request: FastifyRequest, reply: FastifyReply) {
killedBy: tags routes GET /tags returns 200 and a list of tags for GERENTE
statusReason: Unexpected end of JSON input

[Killed] BlockStatement
src/modules/tags/tags.controller.ts:21:71
     return reply.send(tags);
   }
 
-  static async findById(request: FastifyRequest, reply: FastifyReply) {
-    const { id } = tagIdParamSchema.parse(request.params);
-    const tag = await TagsService.findById(id);
-    return reply.send(tag);
-  }
+  static async findById(request: FastifyRequest, reply: FastifyReply) {}
 
   static async update(request: FastifyRequest, reply: FastifyReply) {
killedBy: tags routes GET /tags/:id returns 200 and the tag when found
statusReason: Unexpected end of JSON input

[Killed] BlockStatement
src/modules/tags/tags.controller.ts:27:69
     return reply.send(tag);
   }
 
-  static async update(request: FastifyRequest, reply: FastifyReply) {
-    const { id } = tagIdParamSchema.parse(request.params);
-    const data = updateTagSchema.parse(request.body);
-    const tag = await TagsService.update(id, data);
-    return reply.send(tag);
-  }
+  static async update(request: FastifyRequest, reply: FastifyReply) {}
 }
 
killedBy: tags routes PATCH /tags/:id returns 200 and the updated tag
statusReason: Unexpected end of JSON input
