[Killed] BlockStatement
src/modules/tags/tags.routes.ts:6:56
 import { verifyJWT } from "../../middlewares/auth";
 import { checkRole } from "../../middlewares/rbac";
 
-export async function tagsRoutes(app: FastifyInstance) {
-  app.get(
-    "/",
-    { preHandler: [verifyJWT] },
-    TagsController.findAll,
-  );
-
-  app.get(
-    "/:id",
-    { preHandler: [verifyJWT] },
-    TagsController.findById,
-  );
-
-  app.post(
-    "/",
-    { preHandler: [verifyJWT, checkRole(["GERENTE"])] },
-    TagsController.create,
-  );
-
-  app.patch(
-    "/:id",
-    { preHandler: [verifyJWT, checkRole(["GERENTE"])] },
-    TagsController.update,
-  );
-}
+export async function tagsRoutes(app: FastifyInstance) {}
 
killedBy: tags routes GET /tags returns 200 and a list of tags for GERENTE
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ArrayDeclaration
src/modules/tags/tags.routes.ts:9:19
 export async function tagsRoutes(app: FastifyInstance) {
   app.get(
     "/",
-    { preHandler: [verifyJWT] },
+    { preHandler: [] },
     TagsController.findAll,
   );
killedBy: tags routes GET /tags returns 401 when token is missing
statusReason: expected 200 to be 401 // Object.is equality

[Killed] ArrayDeclaration
src/modules/tags/tags.routes.ts:15:19
 
   app.get(
     "/:id",
-    { preHandler: [verifyJWT] },
+    { preHandler: [] },
     TagsController.findById,
   );
killedBy: tags routes GET /tags/:id returns 401 when token is missing
statusReason: expected 404 to be 401 // Object.is equality
