[Killed] BlockStatement
src/modules/tags/tags.service.ts:7:67
 import { CreateTagInput, TagResponse, UpdateTagInput } from "./tags.types";
 
 export class TagsService {
-  static async create(data: CreateTagInput): Promise<TagResponse> {
-    const existing = await prisma.tag.findUnique({
-      where: { type: data.type },
-    });
-
-    if (existing) {
-      throw new AppError("Tag já cadastrada", 409);
-    }
-
-    return prisma.tag.create({
-      data: { type: data.type },
-    });
-  }
+  static async create(data: CreateTagInput): Promise<TagResponse> {}
 
   static async findAll(): Promise<TagResponse[]> {
killedBy: tags routes POST /tags returns 201 and the created tag
statusReason: Unexpected end of JSON input

[Survived] ObjectLiteral
src/modules/tags/tags.service.ts:9:14
 export class TagsService {
   static async create(data: CreateTagInput): Promise<TagResponse> {
     const existing = await prisma.tag.findUnique({
-      where: { type: data.type },
+      where: {},
     });
 

[Killed] ObjectLiteral
src/modules/tags/tags.service.ts:16:30
       throw new AppError("Tag já cadastrada", 409);
     }
 
-    return prisma.tag.create({
-      data: { type: data.type },
-    });
+    return prisma.tag.create({});
   }
 
killedBy: tags routes POST /tags returns 201 and the created tag
statusReason: expected "vi.fn()" to be called with arguments: [ { data: { type: 'PETG' } } ]

Received:

  1st vi.fn() call:

  [
-   {

[Killed] ObjectLiteral
src/modules/tags/tags.service.ts:17:13
     }
 
     return prisma.tag.create({
-      data: { type: data.type },
+      data: {},
     });
   }
killedBy: tags routes POST /tags returns 201 and the created tag
statusReason: expected "vi.fn()" to be called with arguments: [ { data: { type: 'PETG' } } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] BlockStatement
src/modules/tags/tags.service.ts:21:50
     });
   }
 
-  static async findAll(): Promise<TagResponse[]> {
-    return prisma.tag.findMany({
-      orderBy: { type: "asc" },
-    });
-  }
+  static async findAll(): Promise<TagResponse[]> {}
 
   static async findById(id: number): Promise<TagResponse> {
killedBy: tags routes GET /tags returns 200 and a list of tags for GERENTE
statusReason: Unexpected end of JSON input

[Survived] ObjectLiteral
src/modules/tags/tags.service.ts:22:32
   }
 
   static async findAll(): Promise<TagResponse[]> {
-    return prisma.tag.findMany({
-      orderBy: { type: "asc" },
-    });
+    return prisma.tag.findMany({});
   }
 

[Survived] StringLiteral
src/modules/tags/tags.service.ts:23:24
 
   static async findAll(): Promise<TagResponse[]> {
     return prisma.tag.findMany({
-      orderBy: { type: "asc" },
+      orderBy: { type: "" },
     });
   }

[Killed] BlockStatement
src/modules/tags/tags.service.ts:27:59
     });
   }
 
-  static async findById(id: number): Promise<TagResponse> {
-    const tag = await prisma.tag.findUnique({
-      where: { id },
-    });
-
-    if (!tag) {
-      throw new AppError("Tag não encontrada", 404);
-    }
-
-    return tag;
-  }
+  static async findById(id: number): Promise<TagResponse> {}
 
   static async update(id: number, data: UpdateTagInput): Promise<TagResponse> {
killedBy: tags routes GET /tags/:id returns 200 and the tag when found
statusReason: Unexpected end of JSON input

[Killed] ObjectLiteral
src/modules/tags/tags.service.ts:28:45
   }
 
   static async findById(id: number): Promise<TagResponse> {
-    const tag = await prisma.tag.findUnique({
-      where: { id },
-    });
+    const tag = await prisma.tag.findUnique({});
 
     if (!tag) {
killedBy: tags routes GET /tags/:id returns 200 and the tag when found
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { id: 1 } } ]

Received:

  1st vi.fn() call:

  [
-   {

[Killed] BooleanLiteral
src/modules/tags/tags.service.ts:32:9
       where: { id },
     });
 
-    if (!tag) {
+    if (tag) {
       throw new AppError("Tag não encontrada", 404);
     }
killedBy: tags routes GET /tags/:id returns 200 and the tag when found
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/modules/tags/tags.service.ts:32:9
       where: { id },
     });
 
-    if (!tag) {
+    if (true) {
       throw new AppError("Tag não encontrada", 404);
     }
killedBy: tags routes GET /tags/:id returns 200 and the tag when found
statusReason: expected 404 to be 200 // Object.is equality

[Survived] ObjectLiteral
src/modules/tags/tags.service.ts:41:14
 
   static async update(id: number, data: UpdateTagInput): Promise<TagResponse> {
     const existing = await prisma.tag.findUnique({
-      where: { id },
+      where: {},
     });
 

[Killed] ConditionalExpression
src/modules/tags/tags.service.ts:44:9
       where: { id },
     });
 
-    if (!existing) {
+    if (false) {
       throw new AppError("Tag não encontrada", 404);
     }
killedBy: tags routes PATCH /tags/:id returns 404 when tag does not exist
statusReason: expected 500 to be 404 // Object.is equality

[Killed] ConditionalExpression
src/modules/tags/tags.service.ts:44:9
       where: { id },
     });
 
-    if (!existing) {
+    if (true) {
       throw new AppError("Tag não encontrada", 404);
     }
killedBy: tags routes PATCH /tags/:id returns 200 and the updated tag
statusReason: expected 404 to be 200 // Object.is equality

[Killed] EqualityOperator
src/modules/tags/tags.service.ts:48:23
       throw new AppError("Tag não encontrada", 404);
     }
 
-    if (!data.type || data.type === existing.type) {
+    if (!data.type || data.type !== existing.type) {
       return existing;
     }
killedBy: tags routes PATCH /tags/:id returns 200 and the updated tag
statusReason: expected { id: 1, type: 'PLA' } to match object { id: 1, type: 'PLA+' }

[Killed] LogicalOperator
src/modules/tags/tags.service.ts:48:9
       throw new AppError("Tag não encontrada", 404);
     }
 
-    if (!data.type || data.type === existing.type) {
+    if (!data.type && data.type === existing.type) {
       return existing;
     }
killedBy: tags routes PATCH /tags/:id returns the existing tag without calling update when type is unchanged
statusReason: expected { id: 1, type: 'PLA+' } to match object { id: 1, type: 'PLA' }

[Killed] BlockStatement
src/modules/tags/tags.service.ts:52:9
       return existing;
     }
 
-    try {
-      return await prisma.tag.update({
-        where: { id },
-        data: { type: data.type },
-      });
-    } catch (error) {
+    try {} catch (error) {
       if (
         error instanceof Prisma.PrismaClientKnownRequestError &&
killedBy: tags routes PATCH /tags/:id returns 200 and the updated tag
statusReason: Unexpected end of JSON input

[Killed] BlockStatement
src/modules/tags/tags.service.ts:57:21
         where: { id },
         data: { type: data.type },
       });
-    } catch (error) {
-      if (
-        error instanceof Prisma.PrismaClientKnownRequestError &&
-        error.code === "P2002"
-      ) {
-        throw new AppError("Tag já cadastrada", 409);
-      }
-      throw error;
-    }
+    } catch (error) {}
   }
 }
killedBy: tags routes PATCH /tags/:id returns 409 when the new type collides with another existing tag (race condition)
statusReason: expected 200 to be 409 // Object.is equality

[Killed] ConditionalExpression
src/modules/tags/tags.service.ts:59:9
       });
     } catch (error) {
       if (
-        error instanceof Prisma.PrismaClientKnownRequestError &&
-        error.code === "P2002"
+        false
       ) {
         throw new AppError("Tag já cadastrada", 409);
killedBy: tags routes PATCH /tags/:id returns 409 when the new type collides with another existing tag (race condition)
statusReason: expected 500 to be 409 // Object.is equality

[Killed] ConditionalExpression
src/modules/tags/tags.service.ts:59:9
       });
     } catch (error) {
       if (
-        error instanceof Prisma.PrismaClientKnownRequestError &&
-        error.code === "P2002"
+        true
       ) {
         throw new AppError("Tag já cadastrada", 409);
killedBy: tags routes PATCH /tags/:id returns 500 when update fails with a non-unique-constraint error
statusReason: expected 409 to be 500 // Object.is equality

[Killed] EqualityOperator
src/modules/tags/tags.service.ts:60:9
     } catch (error) {
       if (
         error instanceof Prisma.PrismaClientKnownRequestError &&
-        error.code === "P2002"
+        error.code !== "P2002"
       ) {
         throw new AppError("Tag já cadastrada", 409);
killedBy: tags routes PATCH /tags/:id returns 409 when the new type collides with another existing tag (race condition)
statusReason: expected 500 to be 409 // Object.is equality

[Survived] ConditionalExpression
src/modules/tags/tags.service.ts:60:9
     } catch (error) {
       if (
         error instanceof Prisma.PrismaClientKnownRequestError &&
-        error.code === "P2002"
+        true
       ) {
         throw new AppError("Tag já cadastrada", 409);

[Killed] BlockStatement
src/modules/tags/tags.service.ts:61:9
       if (
         error instanceof Prisma.PrismaClientKnownRequestError &&
         error.code === "P2002"
-      ) {
-        throw new AppError("Tag já cadastrada", 409);
-      }
+      ) {}
       throw error;
     }
killedBy: tags routes PATCH /tags/:id returns 409 when the new type collides with another existing tag (race condition)
statusReason: expected 500 to be 409 // Object.is equality
