[Killed] ConditionalExpression
src/utils/dateFilters.ts:4:7
 import { Periodo } from "../modules/dashboard/dashboard.types";
 
 export function getDateRange(periodo: Periodo, ref?: string) {
-  if (ref) {
+  if (false) {
     const [startStr, endStr] = ref.split(",");
     const start = new Date(`${startStr}T00:00:00`);
killedBy: dashboard routes GET /financeiro uses a custom date range when ref is provided
statusReason: expected '2026-07-11T03:00:00.000Z' to be '2026-01-01T03:00:00.000Z' // Object.is equality

[Killed] BlockStatement
src/utils/dateFilters.ts:4:12
 import { Periodo } from "../modules/dashboard/dashboard.types";
 
 export function getDateRange(periodo: Periodo, ref?: string) {
-  if (ref) {
-    const [startStr, endStr] = ref.split(",");
-    const start = new Date(`${startStr}T00:00:00`);
-    const end = new Date(`${endStr}T23:59:59.999`);
-    return { start, end };
-  }
+  if (ref) {}
 
   const now = new Date();
killedBy: dashboard routes GET /financeiro uses a custom date range when ref is provided
statusReason: expected '2026-07-11T03:00:00.000Z' to be '2026-01-01T03:00:00.000Z' // Object.is equality

[Killed] StringLiteral
src/utils/dateFilters.ts:7:26
   if (ref) {
     const [startStr, endStr] = ref.split(",");
     const start = new Date(`${startStr}T00:00:00`);
-    const end = new Date(`${endStr}T23:59:59.999`);
+    const end = new Date(``);
     return { start, end };
   }
killedBy: dashboard routes GET /financeiro uses a custom date range when ref is provided
statusReason: expected 500 to be 200 // Object.is equality

[Killed] ObjectLiteral
src/utils/dateFilters.ts:19:41
     23, 59, 59, 999,
   );
 
-  const dias: Record<Periodo, number> = {
-    SEMANAL: 7,
-    MENSAL: 30,
-    SEMESTRAL: 180,
-  };
+  const dias: Record<Periodo, number> = {};
 
   const start = new Date(end.getTime() - dias[periodo] * 24 * 60 * 60 * 1000);
killedBy: RF-14 — Controle de Acesso por Perfil (Blackbox) TC-RF14-03 - Usuário Gerente acessa o Dashboard Financeiro
statusReason: expected 500 to be 200 // Object.is equality

[Survived] ArithmeticOperator
src/utils/dateFilters.ts:25:42
     SEMESTRAL: 180,
   };
 
-  const start = new Date(end.getTime() - dias[periodo] * 24 * 60 * 60 * 1000);
+  const start = new Date(end.getTime() - dias[periodo] * 24 * 60 * 60 / 1000);
   start.setHours(0, 0, 0, 0);
 

[Survived] ArithmeticOperator
src/utils/dateFilters.ts:25:26
     SEMESTRAL: 180,
   };
 
-  const start = new Date(end.getTime() - dias[periodo] * 24 * 60 * 60 * 1000);
+  const start = new Date(end.getTime() + dias[periodo] * 24 * 60 * 60 * 1000);
   start.setHours(0, 0, 0, 0);
 

[Survived] MethodExpression
src/utils/dateFilters.ts:26:3
   };
 
   const start = new Date(end.getTime() - dias[periodo] * 24 * 60 * 60 * 1000);
-  start.setHours(0, 0, 0, 0);
+  start.setMinutes(0, 0, 0, 0);
 
   return { start, end };

[Killed] ObjectLiteral
src/utils/dateFilters.ts:28:10
   const start = new Date(end.getTime() - dias[periodo] * 24 * 60 * 60 * 1000);
   start.setHours(0, 0, 0, 0);
 
-  return { start, end };
+  return {};
 }
 
killedBy: RF-10 — Visualização do Dashboard Operacional (Blackbox) TC-RF10-01 - Acessar a aba Dashboard Operacional e carregar período padrão (mensal)
statusReason: expected 500 to be 200 // Object.is equality
