[Killed] ObjectLiteral
src/utils/pagination.ts:19:47
   };
 }
 
-export const paginationQuerySchema = z.object({
-  page: z.coerce.number().int().positive().default(1),
-  pageSize: z.coerce
-    .number()
-    .int()
-    .positive()
-    .max(100, "O tamanho da página não pode ser maior que 100")
-    .default(10),
-});
+export const paginationQuerySchema = z.object({});
 
 export type PaginationQueryInput = z.infer<typeof paginationQuerySchema>;
killedBy: Pagination Utility paginationQuerySchema accepts valid page sizes
statusReason: expected {} to deeply equal { page: 2, pageSize: 50 }

[Killed] MethodExpression
src/utils/pagination.ts:21:13
 
 export const paginationQuerySchema = z.object({
   page: z.coerce.number().int().positive().default(1),
-  pageSize: z.coerce
-    .number()
-    .int()
-    .positive()
-    .max(100, "O tamanho da página não pode ser maior que 100")
+  pageSize: z.coerce.number().int().positive().min(100, "O tamanho da página não pode ser maior que 100")
     .default(10),
 });
killedBy: Pagination Utility paginationQuerySchema accepts valid page sizes
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/utils/pagination.ts:34:23
 export function paginateArray<T>(
   items: T[],
   params: { page: number; pageSize: number },
-): PaginatedResult<T> {
-  const page = Math.max(1, params.page);
-  const pageSize = Math.max(1, params.pageSize);
-  const skip = (page - 1) * pageSize;
-
-  const totalItems = items.length;
-  const paginatedData = items.slice(skip, skip + pageSize);
-
-  return {
-    data: paginatedData,
-    meta: {
-      totalItems,
-      itemCount: paginatedData.length,
-      pageSize,
-      totalPages: Math.ceil(totalItems / pageSize),
-      currentPage: page,
-    },
-  };
-}
+): PaginatedResult<T> {}
 
 export interface PrismaModelDelegate<T, Args> {
killedBy: Pagination Utility paginateArray correctly paginates the first page of an array
statusReason: Cannot read properties of undefined (reading 'data')

[Killed] MethodExpression
src/utils/pagination.ts:35:16
   items: T[],
   params: { page: number; pageSize: number },
 ): PaginatedResult<T> {
-  const page = Math.max(1, params.page);
+  const page = Math.min(1, params.page);
   const pageSize = Math.max(1, params.pageSize);
   const skip = (page - 1) * pageSize;
killedBy: Pagination Utility paginateArray correctly paginates a middle page of an array
statusReason: expected [ 1, 2, 3, 4, 5 ] to deeply equal [ 6, 7, 8, 9, 10 ]

[Killed] MethodExpression
src/utils/pagination.ts:36:20
   params: { page: number; pageSize: number },
 ): PaginatedResult<T> {
   const page = Math.max(1, params.page);
-  const pageSize = Math.max(1, params.pageSize);
+  const pageSize = Math.min(1, params.pageSize);
   const skip = (page - 1) * pageSize;
 
killedBy: Pagination Utility paginateArray correctly paginates the first page of an array
statusReason: expected [ 1 ] to deeply equal [ 1, 2, 3, 4, 5 ]

[Killed] ArithmeticOperator
src/utils/pagination.ts:37:16
 ): PaginatedResult<T> {
   const page = Math.max(1, params.page);
   const pageSize = Math.max(1, params.pageSize);
-  const skip = (page - 1) * pageSize;
+  const skip = (page - 1) / pageSize;
 
   const totalItems = items.length;
killedBy: Pagination Utility paginateArray correctly paginates a middle page of an array
statusReason: expected [ 1, 2, 3, 4, 5 ] to deeply equal [ 6, 7, 8, 9, 10 ]

[Killed] ArithmeticOperator
src/utils/pagination.ts:37:17
 ): PaginatedResult<T> {
   const page = Math.max(1, params.page);
   const pageSize = Math.max(1, params.pageSize);
-  const skip = (page - 1) * pageSize;
+  const skip = (page + 1) * pageSize;
 
   const totalItems = items.length;
killedBy: Pagination Utility paginateArray correctly paginates the first page of an array
statusReason: expected [ 11, 12, 13, 14, 15 ] to deeply equal [ 1, 2, 3, 4, 5 ]

[Killed] MethodExpression
src/utils/pagination.ts:40:25
   const skip = (page - 1) * pageSize;
 
   const totalItems = items.length;
-  const paginatedData = items.slice(skip, skip + pageSize);
+  const paginatedData = items;
 
   return {
killedBy: Pagination Utility paginateArray correctly paginates the first page of an array
statusReason: expected [ 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, …(5) ] to deeply equal [ 1, 2, 3, 4, 5 ]

[Killed] ArithmeticOperator
src/utils/pagination.ts:40:43
   const skip = (page - 1) * pageSize;
 
   const totalItems = items.length;
-  const paginatedData = items.slice(skip, skip + pageSize);
+  const paginatedData = items.slice(skip, skip - pageSize);
 
   return {
killedBy: Pagination Utility paginateArray correctly paginates the first page of an array
statusReason: expected [ 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 ] to deeply equal [ 1, 2, 3, 4, 5 ]

[Killed] ArithmeticOperator
src/utils/pagination.ts:48:29
       totalItems,
       itemCount: paginatedData.length,
       pageSize,
-      totalPages: Math.ceil(totalItems / pageSize),
+      totalPages: Math.ceil(totalItems * pageSize),
       currentPage: page,
     },
killedBy: Pagination Utility paginateArray correctly paginates the first page of an array
statusReason: expected { totalItems: 15, itemCount: 5, …(3) } to deeply equal { totalItems: 15, itemCount: 5, …(3) }

[Killed] BlockStatement
src/utils/pagination.ts:66:32
   model: PrismaModelDelegate<T, Args>,
   args: Args,
   params: { page: number; pageSize: number },
-): Promise<PaginatedResult<T>> {
-  const page = Math.max(1, params.page);
-  const pageSize = Math.max(1, params.pageSize);
-  const skip = (page - 1) * pageSize;
-
-  const [data, totalItems] = await Promise.all([
-    model.findMany({
-      ...args,
-      skip,
-      take: pageSize,
-    } as any),
-    model.count({ where: args.where }),
-  ]);
-
-  return {
-    data,
-    meta: {
-      totalItems,
-      itemCount: data.length,
-      pageSize,
-      totalPages: Math.ceil(totalItems / pageSize),
-      currentPage: page,
-    },
-  };
-}
+): Promise<PaginatedResult<T>> {}
 
killedBy: Pagination Utility paginatePrisma calls findMany and count on the model delegate with correct arguments
statusReason: expected "vi.fn()" to be called with arguments: [ { …(4) } ]

Number of calls: 0

[Killed] MethodExpression
src/utils/pagination.ts:67:16
   args: Args,
   params: { page: number; pageSize: number },
 ): Promise<PaginatedResult<T>> {
-  const page = Math.max(1, params.page);
+  const page = Math.min(1, params.page);
   const pageSize = Math.max(1, params.pageSize);
   const skip = (page - 1) * pageSize;
killedBy: Pagination Utility paginatePrisma calls findMany and count on the model delegate with correct arguments
statusReason: expected "vi.fn()" to be called with arguments: [ { …(4) } ]

Received:

  1st vi.fn() call:

@@ -1,11 +1,11 @@
  [

[Killed] ObjectLiteral
src/utils/pagination.ts:77:17
       skip,
       take: pageSize,
     } as any),
-    model.count({ where: args.where }),
+    model.count({}),
   ]);
 
killedBy: Pagination Utility paginatePrisma calls findMany and count on the model delegate with correct arguments
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { role: 'OPERACIONAL' } } ]

Received:

  1st vi.fn() call:

  [
-   {
